[
  {
    "text": "1\nGENERAL AIR TRANSPORTATION CONDITIONS FOR THE CARRIAGE OF PASSENGERS AND BAGGAGE JETSMART AIRLINES The following General Air Transportation Conditions for the Carriage of Passengers and Baggage (hereinafter the \"General Conditions\") shall apply to all national and international air transport services carried out by JetSMART Airlines, and for all legal purposes are understood to be incorporated in the Airline Ticket which defines the rights and obligations of JetSMART Airlines as Carrier and its Passengers. I.",
    "chunk_id": "condiciones-generales_p1_c0",
    "content_hash": "e567ca196e268a81c81f5f006f095b957aa5509c4c8025b238c3ee091f9df7ce",
    "chunk_index": 0,
    "token_count": 106,
    "char_count": 516,
    "word_count": 75,
    "sentence_count": 2,
    "position_in_doc_percent": 0.0,
    "created_at": "2025-12-26T22:10:01.369800",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 1
  },
  {
    "text": "I. DEFINITIONS. - For the purposes of these General Conditions, each term described below will be understood as follows: \"Ticket\" or \"Airline Ticket\" represents the group of documents that establish the terms and conditions of the air transportation and baggage control contract (where applicable), whether issued manually, electronically or by any equivalent means and which are found in all or some of the following documents: (i) the current General Conditions; (ii) the magnetically recorded electronic ticket; (iii) the Special Conditions applicable to the contracted transport, the fare paid by the Passenger and other optional services purchased with the ticket; (iv) the receipt of the purchase operation issued by the Company; (v) the Boarding Card or Boarding Pass; and, (vi) any communications and booking fees approved by aviation authorities in countries that require it. “General Conditions”, refer to the conditions that determine the air transport contract between JetSMART Airlines and the Passenger. “International Convention(s)”, refers to any of the following instruments, as applicable: (i) Convention for the Unification of Certain Rules Relating to International Carriage by Air, signed in Warsaw on October 12th, 1929 (commonly known as the Warsaw Convention), and subsequent modifications; and (ii) the Convention for the Unification of Certain Rules for International Carriage by Air, signed in Montreal, Canada, on May 18, 1999 (commonly known as the Montreal Convention); and, (iii) Decision 619 of the Andean Community. “The Company” or “JetSMART Airlines” represents the airline that transports and/or agrees to transport the Passenger and/or baggage under these terms and conditions. “Passenger”, is the person, other than crew members, transported or required to be transported on an aircraft pursuant to this contract of carriage. \"Carrier\" or \"Air Carrier\" represents the airline that transports and/or agrees to transport the Passenger and/or baggage under this contract or that performs any other service related to said air transportation.",
    "chunk_id": "condiciones-generales_p1_c1",
    "content_hash": "f8d0e65c22e8d680c1f99f903303c7b12abbaccf7593530ba96b7f3719283f88",
    "chunk_index": 1,
    "token_count": 409,
    "char_count": 2076,
    "word_count": 306,
    "sentence_count": 2,
    "position_in_doc_percent": 0.76,
    "created_at": "2025-12-26T22:10:01.370380",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 1
  },
  {
    "text": "2\n1. The Air Transportation Contract is a contract under which a person, called the Carrier, agrees to carry by air Passengers or other people's belongings from one place to another, for a certain price, and to deliver them to those to whom they are sent. 2. The Carrier's and Passenger's rights and obligations, as defined in Section I (Definitions), arising for the parties on the occasion of the contracted carriage, shall be governed by the Airline Ticket and by any applicable International Conventions, as well as, depending on the case, by the relevant rules of the Chilean Aeronautical Code, the Peruvian Civil Aeronautics Law, Andean Community legislation, the Argentine Aeronautical Code, Colombian Aeronautical Regulations and their regulations and resolutions, Brazilian laws, especially Resolution No. 400 of the National Civil Aviation Agency and others, Paraguayan Aeronautical Code and the Uruguayan Aeronautical Code and its regulations, all of these as the case may be and if applicable. 3. The issuance of the Airline Ticket confirms the acceptance of the contract of carriage entered into between the Passenger and the Carrier whose names appear on the Ticket as well as the acceptance of the conditions thereof. The Ticket, which is issued in the Passenger's name is nominative, personal and non-transferable, unless otherwise expressly provided by applicable law.",
    "chunk_id": "condiciones-generales_p2_c0",
    "content_hash": "f28db5c78877f41f0210affb2c8b73167b35ecdf565be171941d7f5065a1730f",
    "chunk_index": 0,
    "token_count": 280,
    "char_count": 1385,
    "word_count": 215,
    "sentence_count": 5,
    "position_in_doc_percent": 1.53,
    "created_at": "2025-12-26T22:10:01.373008",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 2
  },
  {
    "text": "The Ticket, which is issued in the Passenger's name is nominative, personal and non-transferable, unless otherwise expressly provided by applicable law. It may be issued partially or entirely in printed form or as an electronic ticket. 4. . In general, the Ticket will be valid for a maximum period of one year from the date of issue. Once this period has expired, or any other shorter period indicated in the specific conditions of the service contracted by the Passenger, the Ticket may not be used. 5. If, on the occasion of entering into this contract, the Passenger buys additional services and/or additional products provided and/or delivered by providers outside the Company (e.g. travel insurance, accommodation, transport, luggage packaging, etc.), these services and/or products shall be governed by the contractual provisions that the provider and the Passenger may have agreed between the two parties. In accordance with the aforementioned, the Company is not and will not be responsible for the availability, quality, or integrity of the above-mentioned services and/or products nor for any type of damages of any kind that may affect Passengers on the occasion of their purchase, whatever the cause from which they originate. III. PASSENGERS AND THEIR DOCUMENTS. - 1.",
    "chunk_id": "condiciones-generales_p2_c1",
    "content_hash": "b64aa7f4d712a59ecc019991395cc508523f23f7ea3c22c06a9fdced6b8a9b1f",
    "chunk_index": 1,
    "token_count": 251,
    "char_count": 1281,
    "word_count": 202,
    "sentence_count": 8,
    "position_in_doc_percent": 2.29,
    "created_at": "2025-12-26T22:10:01.373560",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 2
  },
  {
    "text": "III. PASSENGERS AND THEIR DOCUMENTS. - 1. It will be the Passenger's obligation to provide the Carrier with all personal information required for the issuance of the Ticket and for the subsequent effective contact between the parties, such as name, last name, address, identification document number as shown in the document to be used for the trip, telephone number, email address, etc. The Carrier shall not be liable for any damage that occurs or has occurred when the information provided by the Passenger is incomplete, inaccurate, false, partial and/or erroneous. 2. The processing of personal data collected by the Carrier on the occasion of entering into or modifying this contract, as well as contracting services shall be governed by the provisions of the Company's Privacy Policy available at www.jetsmart.com, which is known and accepted by the Passenger and is an integral part of these General Conditions, for all legal purposes.",
    "chunk_id": "condiciones-generales_p2_c2",
    "content_hash": "57844f2532674902d625b37ae3bc5bafcce005dd70c853ff715dca4400203e16",
    "chunk_index": 2,
    "token_count": 183,
    "char_count": 943,
    "word_count": 150,
    "sentence_count": 5,
    "position_in_doc_percent": 3.05,
    "created_at": "2025-12-26T22:10:01.373921",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 2
  },
  {
    "text": "3\nPassengers will have the right to access, know, update, amend, and delete their personal data, as well as to request proof of this authorization and to revoke it, as described in the Privacy Policy. - The buyer of the air ticket, Passenger or their representative, expressly consents to the delivery, collection, management, storage, use and processing of their personal data (whether sensitive or not), and the Company on its part declares that it only requests the strictly necessary data from the Passengers and will keep them confidential, making use only for the transportation service and authorized purposes, in accordance with the applicable data protection laws, including Law No. 19. 628 on the Protection of Private Life of Chile, Brazilian Laws No. 12.965/2014 and 13.709/2019, Law No. 29733 - Personal Data Protection Law of Peru, its Regulation - Supreme Decree No. 003-2013-JUS, and other complementary and amending provisions. The Carrier informs the subjects that their personal data will be processed in connection with the execution of this Agreement, and will be used only for the authorized purposes in accordance with the Carrier's Privacy Policy. The Carrier agrees to implement the organizational, technical and legal security measures that are necessary for the secure and confidential handling of the personal data connected with this Agreement.",
    "chunk_id": "condiciones-generales_p3_c0",
    "content_hash": "d3a202844dee3df56063be50e1e513963636326ab374c54fe614de6b58528c5c",
    "chunk_index": 0,
    "token_count": 274,
    "char_count": 1373,
    "word_count": 213,
    "sentence_count": 3,
    "position_in_doc_percent": 3.82,
    "created_at": "2025-12-26T22:10:01.376419",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 3
  },
  {
    "text": "Passengers declare that they have provided their personal data freely and voluntarily, without any kind of pressure, obligation or condition whatsoever. 3. Passengers are solely responsible for informing themselves about, and obtaining and fulfilling all travel requirements imposed by any authority and must present identification and sanitary documents, permits for exit, transit or entry, visa and any other required documents dependent upon their destination. The Carrier will not be held liable whatsoever for any delays or denial for boarding or for entering into a country that the Passengers may experience in association with, or arising from, their failure to comply with this obligation, except in those cases in which the law expressly establishes the Carrier's liability. 4. Passengers must show up at the gate or check-in desk at the time indicated by the Carrier in the Air Ticket, and if no specific time has been indicated, the Passenger knows they should allow enough time to complete all necessary boarding and departure procedures. 5. Any Passengers who do not show up for travel, arrive late for boarding at the time indicated in the Ticket, or who do not allow enough time as it is stated in the above paragraph, as the case may be, is subject to the corresponding Ticket expiring indefectibly. In such case, the amounts paid for the contracted service will not be refunded, without prejudice to any refunds required by applicable law. 6.",
    "chunk_id": "condiciones-generales_p3_c1",
    "content_hash": "01f21e3559f28a7fc68ebc71cab2a20db030c941c7c93dbc24ea1d112709d0f8",
    "chunk_index": 1,
    "token_count": 276,
    "char_count": 1460,
    "word_count": 235,
    "sentence_count": 6,
    "position_in_doc_percent": 4.58,
    "created_at": "2025-12-26T22:10:01.377066",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 3
  },
  {
    "text": "In such case, the amounts paid for the contracted service will not be refunded, without prejudice to any refunds required by applicable law. 6. Any Passenger with a disability or illness, or in need of assistance during air transport, has the right to request assistance from the Carrier, in accordance with the law in force and the other special conditions informed by the Carrier. In some cases, in order to provide a better service, the Carrier may require prior notification for travel from specific Passengers with a disability or illness, or in need of assistance. Passengers must get information beforehand about certain special transport requirements or conditions that must be met, as well as coordinate with the",
    "chunk_id": "condiciones-generales_p3_c2",
    "content_hash": "68b93d01e4057280fcdca3ce8ba7acb63fb7f77509d76f6172c17e4cfc37928f",
    "chunk_index": 2,
    "token_count": 133,
    "char_count": 721,
    "word_count": 117,
    "sentence_count": 4,
    "position_in_doc_percent": 5.34,
    "created_at": "2025-12-26T22:10:01.377413",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 3
  },
  {
    "text": "4\nCarrier prior to acceptance for boarding, releasing the Carrier from any responsibility in the event that the Carrier denies boarding because the Passenger has failed to comply with the provisions contained in the legal regulations and/or in the current policies of the company. The foregoing shall be understood without prejudice to the limitations and restrictions on the rights of Passengers with disabilities, illness or special needs, based on the safety and protection of the occupants of the aircraft, as regulated in the applicable legal regulations. IV. DENIED BOARDING 1. The Carrier reserves the right, without restriction, to deny transport on any leg of the itinerary booked by the Passenger, if the associated fare has not been partially or fully paid, if the payment method used by the Passenger has been declined, revoked or invalidated or if the Ticket was obtained using means that violate the law or these General Conditions. Furthermore, JetSMART Airlines reserves the right, without restriction, to deny boarding if the Passenger does not have the documents required by law. 2. Notwithstanding any provision applicable to any particular jurisdiction, contained in these General Conditions or in the corresponding regulation, the Carrier will deny boarding to a Passenger, or will proceed to take them off the flight, if it deems the Passenger could affect the safety of the flight or of the other Passengers.",
    "chunk_id": "condiciones-generales_p4_c0",
    "content_hash": "8e806149ed453e4d9dd7a8829846c313b2c019115bae0cf943e51997eb6fb8e0",
    "chunk_index": 0,
    "token_count": 261,
    "char_count": 1431,
    "word_count": 226,
    "sentence_count": 7,
    "position_in_doc_percent": 6.11,
    "created_at": "2025-12-26T22:10:01.379737",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 4
  },
  {
    "text": "Specifically, the Carrier will deny boarding to any Passenger that presents any attitude or behavior while on the ground and/or on board the aircraft that constitutes: (i) any action contrary to instructions given by the cabin crew of the aircraft or any of the Carrier’s employees regarding matters of security, surveillance or of any nature whatsoever; and/or (ii) any behavior contrary to the reasonable behavior which a person or Passenger should maintain; and/or (iii) a violation or offense which in the Carrier's opinion could place the safety of the aircraft or the people and goods on board at risk, or could endanger or jeopardize order and discipline on board the aircraft; and/or (iv) any attitude or behavior, in general, which in the Carrier's opinion may constitute refusal by the Passenger to comply with instructions given by the cabin crew and/or attitudes that could endanger or put the operation at risk and/or disturb the order and/or discipline and/or health and/or comfort of other Passengers or crew; and/or (v) any indication or signs of having consumed excessive amounts of alcoholic beverages and/or any psychotropic substance; and/or (vi) failure to comply with any law or regulation that applies, or that does not comply with any requirement imposed by the governmental authority in question, that applies to the aviation sector Boarding will be also denied if this action is necessary to comply with an applicable legal standard, regulation or order of any state from, within or to which carriage is to be operated, or in which an intermediate stopover is established. 3.",
    "chunk_id": "condiciones-generales_p4_c1",
    "content_hash": "ad1d1c398fb51470e20166491b374fa49c5d317efb6ebe56694a735b717514a0",
    "chunk_index": 1,
    "token_count": 310,
    "char_count": 1601,
    "word_count": 258,
    "sentence_count": 1,
    "position_in_doc_percent": 6.87,
    "created_at": "2025-12-26T22:10:01.380107",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 4
  },
  {
    "text": "In the event that there are more Passengers on a flight with confirmed reservations than seats available, as long as they have completed the check-in procedures within the required time periods, the Carrier will ask for volunteers to give up their seats in exchange for some form of agreed compensation established by applicable laws. If there aren’t enough volunteers and boarding to Passengers must be denied against their will, these Passengers will have the right to compensation as established by applicable laws.",
    "chunk_id": "condiciones-generales_p4_c2",
    "content_hash": "4f26f57c57c953a973c9e69305ae2ea32abefcfeaeaae69d2f9aae891ba61386",
    "chunk_index": 2,
    "token_count": 92,
    "char_count": 518,
    "word_count": 82,
    "sentence_count": 2,
    "position_in_doc_percent": 7.63,
    "created_at": "2025-12-26T22:10:01.380440",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 4
  },
  {
    "text": "5\nV. BAGGAGE TRANSPORTATION. – 1. The Passenger must comply with the baggage weight, measurements and maximum allowances, as indicated in the particular conditions applicable to the contracted transport accepted by the Passenger at the time of purchase, and contained in the purchase receipt issued by the Carrier. The carriage of any excess baggage shall be paid in accordance with the fares and subject to the special conditions informed by the Carrier. The baggage policy, payments or surcharges to which excess baggage is subject, understood as those kilos and/or pieces that exceed the permitted baggage, can also be checked at the Carrier’s website www.jetsmart.com 2. The Carrier may refuse to carry all or part of the baggage that is beyond the baggage policy or if the Passenger has not paid for excess of baggage. 3. . The Baggage allowed, and/or charges and other conditions relating to excess baggage may vary according to the particular conditions of the contracted service, cabin and route, and will be expressed in pieces and/or kilos. The Carrier reserves the right to alter the baggage policy, values, and dimensions of baggage, informing the public of such changes in a timely manner. The conditions and contract values of each particular service shall be registered with the relevant local aviation authorities to the extent required. 4.",
    "chunk_id": "condiciones-generales_p5_c0",
    "content_hash": "77e9c82332859a05422a874d73d267797a8a41c1d71e82788ba5e256bca4fe7b",
    "chunk_index": 0,
    "token_count": 264,
    "char_count": 1356,
    "word_count": 218,
    "sentence_count": 9,
    "position_in_doc_percent": 8.4,
    "created_at": "2025-12-26T22:10:01.382264",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 5
  },
  {
    "text": "The conditions and contract values of each particular service shall be registered with the relevant local aviation authorities to the extent required. 4. In accordance with the baggage policy, the Carrier shall issue, in duplicate and shall deliver a copy to the Passenger of a baggage tag or receipt for the checked baggage to be carried, except for personal items carried by the Passenger. The baggage tag or receipt will contain instructions indicated by the applicable law. The baggage tag is proof that the luggage has been checked in and that the conditions of the transport contract have been met. Checked baggage will be delivered to the baggage tag holder. In the absence of a baggage tag, the Carrier may require identification to those entitled to claim the baggage and postpone baggage delivery until valid identification is provided. 5. The Carrier shall not check baggage at a destination other than the final destination shown on the Passenger's Ticket, or on any flight other than the one on which the Passenger is to board. 6. Baggage is defined as only the Passenger's personal belongings necessary for their trip, and those that are expressly incorporated by virtue of an applicable legal regulation. 7.",
    "chunk_id": "condiciones-generales_p5_c1",
    "content_hash": "931b6e51acc0a0ccc4bc4db85267922ee75960869acbd0e2d193ae3b15652544",
    "chunk_index": 1,
    "token_count": 226,
    "char_count": 1222,
    "word_count": 201,
    "sentence_count": 8,
    "position_in_doc_percent": 9.16,
    "created_at": "2025-12-26T22:10:01.382742",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 5
  },
  {
    "text": "In compliance with local and international regulations, the Carrier will deny the transportation as baggage (whether carry-on or checked), of any dangerous articles or substances that could pose a serious risk to health or the safety of the flight or any property, such as: a) Gases (compressed, liquid, stored in solution or heavily refrigerated) including flammable, toxic or harmless aerosols such as butane, oxygen, liquid nitrogen, aerosols that contain paralyzing gases, refill tubes for liquid-gas lighters, etc. b) Corrosives, whether solid or liquid, such as acids, alkalis, mercury, liquid electrolyte batteries, etc.",
    "chunk_id": "condiciones-generales_p5_c2",
    "content_hash": "d007c04ff628ab933fad3909730d6fba3094b06e76a25cd02811a6729205e186",
    "chunk_index": 2,
    "token_count": 133,
    "char_count": 627,
    "word_count": 92,
    "sentence_count": 1,
    "position_in_doc_percent": 9.92,
    "created_at": "2025-12-26T22:10:01.382905",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 5
  },
  {
    "text": "6\nc) Explosives such as ammunition, fireworks and flares, briefcases with alarm devices, detonation devices for toy guns, etc. d) Flammable liquids such as fuel, paints, thinners, etc. e) Radioactive materials, regardless of their category. f) Oxidizers and organic peroxides such as bleach, fertilizer, etc. g) Toxic and infectious substances such as: insecticides, pesticides, biological products that contain pathogenic germs, etc. h) Flammable solids such as matches. i) Weapons, which are understood to be any element or object that is made or could be used for attack or defense, such as guns, bladed weapons, gases, electric shock devices, spiked, sharp or blunt objects, which could include objects like clubs, axes, walking sticks or bats that have weight inside them or have any sharp point. j) Any other item classified as dangerous by applicable law. 8. In order to ensure the safety of the flight and comply with current regulations, the Carrier and the airport security personnel may confiscate dangerous articles and substances carried by the Passenger or inside his/her carry-on baggage, in order to deliver them to the respective authorities in accordance with applicable local regulations. 9.",
    "chunk_id": "condiciones-generales_p6_c0",
    "content_hash": "b7b0482c2da95858b16326f8725e33d621a4e7506ecfe6451c22085240b18153",
    "chunk_index": 0,
    "token_count": 254,
    "char_count": 1210,
    "word_count": 187,
    "sentence_count": 2,
    "position_in_doc_percent": 10.69,
    "created_at": "2025-12-26T22:10:01.384769",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 6
  },
  {
    "text": "In case of destruction, loss or damage of luggage, which occurs during transport, or in case of delay in its delivery, the regulations contained in the International Conventions, the Chilean Aeronautical Code, Argentine Aeronautical Code, Peruvian Civil Aeronautics Law and its Regulations (Law N° 27261 and Supreme Decree N° 050-2001-MTC and amendments), Colombian Aeronautical Regulations, Brazilian laws, especially Resolution No. 400 of the National Civil Aviation Agency and others, Paraguayan Aeronautical Code and Uruguayan Aeronautical Code, will be addressed, as applicable. For the purposes of the foregoing paragraph, \"delay\" shall mean any delay caused when collecting the luggage and which has occurred under the direct responsibility of the Carrier. VI. CHANGES IN THE PURCHASED SERVICES. - Excluding the exceptions in these General Terms and Conditions or as expressly provided by law, any change and/or modification that the Passenger may wish to apply to the services contracted with the Carrier, may be subject to the obligation of the Passenger to make one or more payments other than those originally made when contracting the aforementioned services During the purchase process, Passengers received and accepted information on the permitted changes and modifications, their cost, and the procedures related to them. This list of changes and modifications can also be found at www.jetsmart.com VII. LIMITS OF LIABILITY. – 1.",
    "chunk_id": "condiciones-generales_p6_c1",
    "content_hash": "ed088461d57c11924fad922eaa775dd7262508d7476b33e848d2a733730d9b4a",
    "chunk_index": 1,
    "token_count": 290,
    "char_count": 1444,
    "word_count": 215,
    "sentence_count": 6,
    "position_in_doc_percent": 11.45,
    "created_at": "2025-12-26T22:10:01.385241",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 6
  },
  {
    "text": "This list of changes and modifications can also be found at www.jetsmart.com VII. LIMITS OF LIABILITY. – 1. The obligation of the Carrier shall be understood to be fully and completely fulfilled by the fact of transporting the Passenger and their luggage with reasonable punctuality, taking into account the special circumstances of the case. The Carrier shall make reasonable efforts to transport Passengers and their baggage in accordance with published itineraries and those",
    "chunk_id": "condiciones-generales_p6_c2",
    "content_hash": "18269464a75b5938891047820d276ece5588db0cd89ae2100fb84811a543691a",
    "chunk_index": 2,
    "token_count": 88,
    "char_count": 477,
    "word_count": 73,
    "sentence_count": 4,
    "position_in_doc_percent": 12.21,
    "created_at": "2025-12-26T22:10:01.385458",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 6
  },
  {
    "text": "7\nreflected on the Air Ticket. The Carrier may itself be replaced by alternate airlines, by other aircraft, may delay or cancel flights, change the assignment of seats, and modify or delete stopovers provided for in the Ticket at any time it deems necessary, for justified reasons and in accordance with current regulations. 2. Any exemption or limitation of the Carrier's liability under applicable local or international law shall apply and be for the benefit of the Carrier's agents, employees and representatives and any other person or company whose aircraft is used by the Carrier to perform the transport and the agents, employees or representatives of such person or company. 3. If an agent issues a ticket for carriage on legs involving different carriers, the Carrier shall only be liable for the leg they actually completed. Also, the travel agency will be responsible for providing all information to the Passenger, especially regarding the requirements for entry to certain countries or transit, among other information. 4. The liability of the Carrier in case of death or personal injury to the Passenger, denied boarding and/or for baggage loss, delay or damage on international flights, is limited by international conventions or any applicable international standard, and in the case of trips beginning and ending in the same country, the limits of liability will be governed by the applicable legislation of the country in question. 5.",
    "chunk_id": "condiciones-generales_p7_c0",
    "content_hash": "de9b26343e5e2650cad05de8ea343b9de9bcd964af8b5cb983c211253d8b9a5c",
    "chunk_index": 0,
    "token_count": 269,
    "char_count": 1453,
    "word_count": 232,
    "sentence_count": 6,
    "position_in_doc_percent": 12.98,
    "created_at": "2025-12-26T22:10:01.387107",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 7
  },
  {
    "text": "Regarding those items with high commercial value and electronic devices, and others established by applicable law, the Passenger must transport these items as carry-on baggage in order to always keep control of them as they are their responsibility. The Carrier shall not be liable for these beyond the limits established by the law or applicable International Conventions and subject to accreditation. VIII. PASSENGERS' RIGHTS ACCORDING TO THE CHILEAN AERONAUTICAL CODE, APPLICABLE TO OPERATIONS IN CHILE. VIII.I. Denied boarding due to overbooking In case of denied boarding due to overbooking, the Passenger shall have the rights set forth in Articles 133 and 133A of the Chilean Aeronautical Code. In the event that the Carrier foresees that they will have to deny boarding to one or more Passengers who have shown up in a timely manner and whose Ticket was previously confirmed on a given flight due to overbooking, they must first request that volunteers show up to give up their reservations in exchange for certain benefits and compensation to be agreed between the volunteers and the Carrier. If there are not enough volunteers to give up their seats so that the remaining Passengers holding a confirmed ticket can board the corresponding flight, the Carrier can deny boarding to one or more Passengers against their will. These Passengers will have the right to:",
    "chunk_id": "condiciones-generales_p7_c1",
    "content_hash": "f9ceeb6551d7fd6386447c4ac008210a02fc61453fe3fecd94e55e9d64ea08fc",
    "chunk_index": 1,
    "token_count": 270,
    "char_count": 1372,
    "word_count": 221,
    "sentence_count": 9,
    "position_in_doc_percent": 13.74,
    "created_at": "2025-12-26T22:10:01.387584",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 7
  },
  {
    "text": "8\n1. Passenger's choice: a) Board the next available flight provided by the carrier, or in an alternative transport, if they decide to persist in the air carriage contract; b) To receive reimbursement of the full amount paid for the ticket if the Passenger withdraws from the air transportation contract only if the trip has not begun; or c) If the trip with stopovers and/or connections had already started, the Passenger can choose to: i. Board the next available flight provided by the carrier, or in an alternative transport, if they decide to persist in the air carriage contract; ii. Receive a refund of the unused part; or iii. Return to the starting point and receive reimbursement of the ticket price. 2.",
    "chunk_id": "condiciones-generales_p8_c0",
    "content_hash": "acc50ac16933edf8033a6e68859326b4d39aa0b5b7e4e05723abff865eb27246",
    "chunk_index": 0,
    "token_count": 148,
    "char_count": 713,
    "word_count": 122,
    "sentence_count": 5,
    "position_in_doc_percent": 14.5,
    "created_at": "2025-12-26T22:10:01.389043",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 8
  },
  {
    "text": "Receive a refund of the unused part; or iii. Return to the starting point and receive reimbursement of the ticket price. 2. To receive compensation for denied boarding up to an amount calculated based on the following table: Distance of denied boarding flight (in km) Between 1-3 hours delay on arrival time at destination Between 3-4 hours delay on arrival time at destination above 4 hours of delay on arrival time at destination\nLess than 500 km 2 UF 2 UF 2,5 UF Between 500 km and 1.000 km 3 UF 3 UF 3,75 UF Between 1.000 km and 2.500 km 4 UF 4 UF 5 UF Between 2.500 km and 4.000 km 8 UF 10 UF 10 UF Between 4.000 km and 8.000 km 12 UF 15 UF 15 UF More than 8.000 km 16 UF 20 UF 20 UF Regarding the above compensations, Passengers must keep in mind: a) A Passenger who accepts such compensation may not subsequently bring an action against the Carrier for the same reason, without prejudice to the infringements and compensations established in Law No. 19,496, which sets forth rules on the protection of consumers' rights. b) If, in accordance with the provisions of 1a of point 1 above, the Passenger is embarked on the next flight the Carrier has available, and the difference in departure time with respect to the flight originally booked is less than three hours, no compensation shall be granted for denied boarding.",
    "chunk_id": "condiciones-generales_p8_c1",
    "content_hash": "8e8cb60cbd342f646e2e90d472c4296fbc22d40fa8460bbd2b290ec69fe41dd9",
    "chunk_index": 1,
    "token_count": 331,
    "char_count": 1326,
    "word_count": 243,
    "sentence_count": 3,
    "position_in_doc_percent": 15.27,
    "created_at": "2025-12-26T22:10:01.389395",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 8
  },
  {
    "text": "9\n3. If the Passenger decides to continue with the contract in the event of denied boarding, they shall be entitled to receive the following assistance from the Carrier: a) Communications that the Passenger needs to make, whether by telephone, electronic or other similar means, if there is a difference of more than three hours in the scheduled time of departure for the flight initially booked; b) Meals and snacks, equal to at least 0.5 unidades de fomento (Chilean unit of currency not expressed in pesos) when the time between the scheduled departure time of the originally booked flight and the new departure time is equal to or more than two hours. Upon expiration of the above time period, the Passenger shall be entitled to a new benefit, for the same cost, every time an additional three hours of waiting time passes. These benefits shall be provided within each corresponding period, shall not be cumulative, and will not apply if the Passenger is not physically present at the airport, or if the benefits of letter c) below apply; c) Accommodation for return and outbound Passengers who were denied boarding at a connecting point, who do not reside in the city, town or area of the departure airport, in the event that they are offered a new flight, of which the departure is at least on the day following the scheduled departure on the Ticket, provided that the Passenger must stay one or more nights, and the waiting time to board the other flight requires it.",
    "chunk_id": "condiciones-generales_p9_c0",
    "content_hash": "d77c205e9516beb9b57cec8d11a0000967c4a5a6222825592be34cbb12f162ec",
    "chunk_index": 0,
    "token_count": 295,
    "char_count": 1474,
    "word_count": 255,
    "sentence_count": 4,
    "position_in_doc_percent": 16.03,
    "created_at": "2025-12-26T22:10:01.391351",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 9
  },
  {
    "text": "For these purposes, \"night\" shall be defined as the time between midnight to 6 a.m.; d) Transfer from the airport to the Passenger's place of residence in the city, town or area surrounding the departure airport, or to the place of accommodation, and back again, if applicable; and e) The necessary arrangements and services to continue the trip, in case the Passenger misses a connecting flight that has been confirmed. For the purposes of this section, a Ticket shall be considered as confirmed, with respect to the points of departure and destination indicated therein, including intermediate points of connection or stopover, to the extent that it is established that the reservation or the Ticket has been accepted and registered by the Air Carrier or its authorized agent. “Stopover and/or connecting journey\" is understood as a journey which includes a point of departure and one or more intermediate points of stopover and/or connection on arrival at the destination, when these are part of the same contract. Without prejudice to other additional services that the Carrier may offer, depending on the circumstances and the special condition of the Passenger, in the event of denied boarding the Carrier shall embark, as a priority, unaccompanied children, people with disabilities, elderly or health-sensitive Passengers, pregnant women who, due to their condition, require preferential boarding and, in general, Passengers who, for humanitarian reasons qualified by the Carrier, must be embarked first. VIII.II.",
    "chunk_id": "condiciones-generales_p9_c1",
    "content_hash": "a47588cf74f9ee7025f3843337386ccbd84ad570bf5ebc75477945f6c12d06ab",
    "chunk_index": 1,
    "token_count": 289,
    "char_count": 1521,
    "word_count": 236,
    "sentence_count": 4,
    "position_in_doc_percent": 16.79,
    "created_at": "2025-12-26T22:10:01.391862",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 9
  },
  {
    "text": "VIII.II. Delays and cancelations The Carrier is required to comply with transporting Passengers on the date, schedule and other agreed terms and conditions. However, the Carrier can suspend, delay and cancel the flight or modify these terms and conditions on grounds of force majeure or for safety reasons such as bad",
    "chunk_id": "condiciones-generales_p9_c2",
    "content_hash": "6643e066c0d7711cafee0bc9e3613e5ec6d7b70109c7b1523411eebb732c2338",
    "chunk_index": 2,
    "token_count": 64,
    "char_count": 317,
    "word_count": 51,
    "sentence_count": 3,
    "position_in_doc_percent": 17.56,
    "created_at": "2025-12-26T22:10:01.392032",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 9
  },
  {
    "text": "10\nweather, armed conflicts, civil unrest or threats against the aircraft. In such cases, any of the contracting parties may rescind the contract, being each one responsible for their own losses. Notwithstanding the foregoing, in the event of a flight delay or cancellation the Passenger will be entitled to: 1. Board the next available flight provided by the carrier, or in an alternative transport, if they decide to persist in the air carriage contract; whether the flight has not yet departed or did depart but is on a stopover and/or connection. 2. Receive the assistance benefits indicated under the heading 3 of section VIII. I.- \"Denied Boarding for overbooking\" above, provided that the cause of the delay or cancelation is attributable to the Carrier. 3. Receive compensation for the damages that may have been caused if the delay or cancelation is due to reasons attributable to the Carrier, in accordance with the following: a) Domestic flights: The compensation of the damages incurred in domestic flights shall not exceed 250 UF for each of the affected Passengers, and shall proceed in the following cases: i. If the delay is longer than three hours with regard to the departure time scheduled on the Airline Ticket, or four hours on flights using aircraft designed for a capacity of up to 29 seats. ii.",
    "chunk_id": "condiciones-generales_p10_c0",
    "content_hash": "dbe28c0bb4c1bd1f1356931e7dee42a420ddced996b1c981c221a5c3505a4dad",
    "chunk_index": 0,
    "token_count": 268,
    "char_count": 1318,
    "word_count": 220,
    "sentence_count": 8,
    "position_in_doc_percent": 18.32,
    "created_at": "2025-12-26T22:10:01.393900",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 10
  },
  {
    "text": "At the time of cancelation, unless the Passenger is informed and offered to take another flight that allows them to leave for their destination with no more than three hours of delay with regard to the scheduled departure time, or four hours on flights using aircraft designed for a capacity of up to 29 seats. Any change in the itinerary, due to an early arrival, delay or cancellation of the flight, the Carrier will inform the Passenger by written communication through the most efficient means possible, indicating the reason for the change. For the purposes of communicating these changes or others that are necessary regarding this Contract, the Passenger must inform the Carrier, directly or through its authorized agents, of their contact details, such as address, telephone number and e- mail, when booking or purchasing their Ticket. In any case, it should be kept in mind that the compensation for damages regulated in this section shall not apply if the Carrier proves that they took the necessary measures to avoid the event causing the delay, or that such measures were impossible for the Carrier to take. b) International flights: In case of damage caused by delay in the carriage of Passengers, the liability of the Carrier shall be limited to 5,346 Special Drawing Rights (of the International Monetary Fund) per Passenger.",
    "chunk_id": "condiciones-generales_p10_c1",
    "content_hash": "c6052de1f7ae9ceb4bb1b81db17a1e305e0fa927eba628082121bace2868ff3f",
    "chunk_index": 1,
    "token_count": 252,
    "char_count": 1340,
    "word_count": 221,
    "sentence_count": 4,
    "position_in_doc_percent": 19.08,
    "created_at": "2025-12-26T22:10:01.394343",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 10
  },
  {
    "text": "Such limit shall not apply if it is proved that the damage is the result of an act or omission of the Carrier or its employees or agents, with intent to cause damage, or recklessly and knowing that it would probably cause harm; provided that, in the case of an act or omission of an employee or agent, it is also proved that they acted in the exercise of their functions. In any case, it should be kept in mind that the compensation for damages regulated in this section shall not apply if the Carrier proves that they, their employees and agents took all the reasonably necessary measures to avoid the event causing the delay, or that such measures were impossible for the Carrier, their employees or the agents to take.",
    "chunk_id": "condiciones-generales_p10_c2",
    "content_hash": "246ee97ffa40bd1b85b43d06282724ddc6cc28bc40ba95e97ab173be6db83d42",
    "chunk_index": 2,
    "token_count": 143,
    "char_count": 721,
    "word_count": 131,
    "sentence_count": 2,
    "position_in_doc_percent": 19.85,
    "created_at": "2025-12-26T22:10:01.394611",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 10
  },
  {
    "text": "11\n4. To receive reimbursement of the total amount paid for the Ticket or of the unused portion, as the case may be, if the Passenger decides not to continue with the contract and the periods of section 3 above have passed whether or not the Carrier is responsible for the cause of the delay or cancelation. VIII.III Refund of fees If the trip is not verified, whether for any reason attributable to the Carrier, the Passengers or for reasons of security or supervening force majeure, the taxes, charges or aeronautical rights paid by the Passenger will be returned by the Carrier whether the Passenger requests it or not, within 10 days, through the same payment method used to pay for the air ticket However, if such reimbursement has not been made or if payment in cash has been verified, the Carrier shall contact the Passenger so that they provide information on how they would like to receive this reimbursement, which must happen within a maximum period of ten days from the date the trip should have been verified. Such restitution shall be made within a maximum period of ten days after the Passenger provides the Carrier with the necessary information for this purpose. In case of unjustified delay, such reimbursement shall increase by fifty percent in favor of the Passenger every thirty days.",
    "chunk_id": "condiciones-generales_p11_c0",
    "content_hash": "c04c3850834a3bc02e52be37cd4f3dc90b5302ee76e46bf9b7521a652ea146c6",
    "chunk_index": 0,
    "token_count": 255,
    "char_count": 1305,
    "word_count": 224,
    "sentence_count": 5,
    "position_in_doc_percent": 20.61,
    "created_at": "2025-12-26T22:10:01.396159",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 11
  },
  {
    "text": "In case of unjustified delay, such reimbursement shall increase by fifty percent in favor of the Passenger every thirty days. Once the first thirty-day period has expired and the Passenger has not received reimbursement, the Passenger may choose to request reimbursement from the authorized agent who made the sale, or to persist with the reimbursement and surcharges in accordance with the aforementioned. In case of reservations that include several tickets, the taxes, charges or aeronautical rights of those trips of the reservation that have not been verified will be refunded to the payment method used by the person who paid for the reservation. In case of taxes that have not been included in the amount paid (i.e., they were collected directly by the airport), the Passenger must request their reimbursement directly to the respective airport authority, in accordance with the applicable regulations. VIII.IV. No additional charges for unintentional upgrades In the event that the Carrier accommodates a Passenger in a higher class than the one paid for, and this is the result of any circumstances beyond the Passenger's control, the Carrier may not demand any additional payment. No agent, employee or representative of the Carrier has the authority to change or waive any provision or term of these General Conditions. VIII.VI Inability to travel due to medical conditions The date scheduled for a trip may be modified, or a refund of the amount paid may be requested, if the Passenger proves, through a medical certificate, that he/she is unable to travel.",
    "chunk_id": "condiciones-generales_p11_c1",
    "content_hash": "f305541c964741df2b22236957462e9c04d44ad5e75402b0f4566438ec044564",
    "chunk_index": 1,
    "token_count": 290,
    "char_count": 1569,
    "word_count": 251,
    "sentence_count": 8,
    "position_in_doc_percent": 21.37,
    "created_at": "2025-12-26T22:10:01.396614",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 11
  },
  {
    "text": "12\nwhich the Passenger is unable to travel by air. The Passenger must notify the Carrier of the change before the scheduled flight time, and must present the respective medical certificate within twenty-four hours of the notice. If the Passenger chooses to request a refund of the amount paid, this will be made within thirty days of the original scheduled date of travel. Should the exchange be made for a Ticket of higher value, the Passenger shall pay the difference. The new travel date may be set up to one year from the original scheduled travel date. This right may also be claimed by the Passenger's spouse or civil partner, his/her parents and children, provided that they are included in the same reservation. The inappropriate use or counterfeiting of such medical certificate shall be punished in accordance with the provisions of Article 202 of the Chilean Penal Code. VIII.VII Limiting the request for consecutive order of travel sections. In the case of domestic air transportation services or cabotage that are divided into sections and/or round trips, the non-use of any of the segments may not cause the denial or condition the use of the rest of the segments, if the Passenger shows up at the check-in and boarding gate in due time. VIII.VIII Adjoining seats for minors.",
    "chunk_id": "condiciones-generales_p12_c0",
    "content_hash": "ccd872670fb7852866ad92db811f5d10032e1d896188afb3f8777b26da3eba35",
    "chunk_index": 0,
    "token_count": 253,
    "char_count": 1289,
    "word_count": 217,
    "sentence_count": 10,
    "position_in_doc_percent": 22.14,
    "created_at": "2025-12-26T22:10:01.398460",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 12
  },
  {
    "text": "VIII.VIII Adjoining seats for minors. The Carrier shall take the necessary measures to ensure that children under 14 years of age travel in seats next to at least one adult member of their family or an adult included in the same reservation. VIII.IX Assignment of Passenger Ticket For cabotage or domestic flights within Chile, the Passenger may assign freely and free of charge their right to be transported for one-way and/or return journeys. The assignment may only be made up to twenty-four hours prior to the flight, and shall be perfected by means of the individualization of the assignor and the assignee in the digital form that the Carrier shall provide for such purpose on its official website. In such document, the Carrier may also request the data that will allow the identification of the ticket and other aspects necessary to ensure the correct assignment of the rights. The aforementioned may also be done personally at the ticket sales offices, airport counters and authorized agencies of the Carrier. Once the above information has been entered, the assignor will receive a receipt of the assignment of the rights. It will be the sole responsibility of the assignor that the information provided is accurate and correct. Notwithstanding the provisions of the preceding paragraphs, the assignment of the corresponding rights may be done only between natural persons and only once for each Passenger ticket, and any subsequent transfer by the assignee shall be null and void.",
    "chunk_id": "condiciones-generales_p12_c1",
    "content_hash": "dc80a4cdab0bc65414d94b195d0ab53c2d2550d169cb1bf568a7293e991f600e",
    "chunk_index": 1,
    "token_count": 278,
    "char_count": 1491,
    "word_count": 243,
    "sentence_count": 9,
    "position_in_doc_percent": 22.9,
    "created_at": "2025-12-26T22:10:01.399092",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 12
  },
  {
    "text": "Likewise, in a calendar year, the Passenger may only assign their right up to a maximum of two times per carrier, at the rate of one assignment for each six-month period. In no case may such assignments be made for profit, nor as a commercial activity or on a regular basis. Notwithstanding the foregoing, assignments carried out by virtue of this article, provided that they are made up to the maximum number of times indicated in the preceding paragraph, shall not",
    "chunk_id": "condiciones-generales_p12_c2",
    "content_hash": "ba00fa4ed1888fa364c17219540e12c4359aea7bb581ca9e0cf31235a7055258",
    "chunk_index": 2,
    "token_count": 93,
    "char_count": 466,
    "word_count": 81,
    "sentence_count": 3,
    "position_in_doc_percent": 23.66,
    "created_at": "2025-12-26T22:10:01.399315",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 12
  },
  {
    "text": "13\nconstitute habitual activity. Anyone who, in disregard of the provisions of this paragraph (paragraph seven of article 131 bis of the Aeronautical Code), assigns their right to be transported on a cabotage flight, or enables such assignment, shall be sanctioned with a fine of between eleven and twenty monthly tax units. The same penalty shall be imposed on the assignee of the aforementioned right who, in disregard of the provisions of the fifth paragraph of Article 131 bis, transfers it again, under any title, or on the person who enables such operation. In case of repeating the aforementioned conducts, the penalty shall be short-term imprisonment in its medium degree and a fine of twenty-one to thirty monthly tax units. VIII.X Right of withdrawal For purchases through JetSMART.com and the Contact Center, the right of withdrawal established in Article 3 bis letter b) of Law No. 19.496 on Consumer Rights Protection does not apply. Without prejudice to the foregoing, the Passenger shall have the right to unilaterally terminate the air transportation contract on cabotage or domestic flights within Chile, within forty-eight hours after purchasing a Ticket, for trips purchased at least seven calendar days prior to the scheduled departure date and time of the flight. Passengers, under these conditions, may cancel the Contract and receive a full refund of the amount paid, without incurring any penalty.",
    "chunk_id": "condiciones-generales_p13_c0",
    "content_hash": "b308fe6fa344a857143e1a246808f3549c0b1bb8fe2b5f1d01ae1283a8d73693",
    "chunk_index": 0,
    "token_count": 278,
    "char_count": 1421,
    "word_count": 226,
    "sentence_count": 7,
    "position_in_doc_percent": 24.43,
    "created_at": "2025-12-26T22:10:01.401254",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 13
  },
  {
    "text": "Passengers, under these conditions, may cancel the Contract and receive a full refund of the amount paid, without incurring any penalty. However, in the event that the scheduled departure of the flight takes place within one hundred and eighty days or more from the date of purchase of the Ticket, the withdrawal period may be applied within seven days after the conclusion of the air transportation contract. In these cases, the Passengers, likewise, will receive a full refund of the amount paid, without penalty, and the agreement will be rendered null and void. To exercise this power, the Carrier shall have a digital form for this purpose, available on the official website www.jetsmart.com, where the Passenger may declare their free and expressed will to withdraw. The aforementioned may also be done personally at the ticket sales offices, airport counters and authorized agencies of the Carrier, if any. The refund resulting from the exercise of the right of withdrawal shall be reimbursed by the Carrier, whether or not requested by the Passenger, within ten days, through the same payment method used to pay for the Ticket. This term shall be extended to thirty days in the aforementioned cases, in which the scheduled departure of the flight takes place within one hundred and eighty days or more from the date of purchase of the Ticket.",
    "chunk_id": "condiciones-generales_p13_c1",
    "content_hash": "ea16e55934f1bbf1ee1535f8995414a40bcbe42a4166554ddca9321c98beb308",
    "chunk_index": 1,
    "token_count": 257,
    "char_count": 1350,
    "word_count": 223,
    "sentence_count": 7,
    "position_in_doc_percent": 25.19,
    "created_at": "2025-12-26T22:10:01.401721",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 13
  },
  {
    "text": "However, if such reimbursement has not been made or if payment in cash has been verified, the Carrier shall contact the Passenger so that they provide information on how they would like to receive this reimbursement, which must happen within a maximum period of ten days from the date the trip should have been verified. Such reimbursement shall be made within a maximum period of ten days after the Passenger provides the Carrier with the necessary information for this purpose. In case of unjustified delay, such reimbursement shall increase by fifty percent in favor of the Passenger every thirty days. Once the first thirty-day period has expired and there is no verification that the Passenger has received their reimbursement, the Passenger may choose to request reimbursement from the authorized agent who made the sale, or to persist with the reimbursement and surcharges in",
    "chunk_id": "condiciones-generales_p13_c2",
    "content_hash": "d6ea941bd79ddd68c80acaea9b1d39e0fc08e8df2820588e1686b22f1c292636",
    "chunk_index": 2,
    "token_count": 155,
    "char_count": 882,
    "word_count": 143,
    "sentence_count": 4,
    "position_in_doc_percent": 25.95,
    "created_at": "2025-12-26T22:10:01.401961",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 13
  },
  {
    "text": "14\naccordance the previous paragraph. The foregoing, without prejudice to the right of the authorized agent to reimburse the Carrier, when applicable. VIII.IX Contact Information and Dispute Resolution In case of any questions related to the trip, the Passenger may contact the Company by telephone, ask questions through social networks or browse the frequently asked questions available on the Company's website. More contact information is available in the \"Help Center\" section of the website at https://jetsmart.com/cl/es/centro-de-ayuda/ In turn, in the event of any dispute, complaint or claim, the Passenger shall have the right to go before the court having jurisdiction in accordance with the provisions set forth in the Chilean Aeronautical Code and Law 19.496 on Protection of Consumers' Rights. IX. PERU AND COLOMBIA: PASSENGERS' RIGHTS ACCORDING TO THE DECISION 619 OF THE ANDEAN COMMUNITY IN PERU AND COLOMBIA, APPLICABLE TO OPERATIONS IN PERU AND COLOMBIA. IX. Denied boarding due to causes attributable to the Carrier In case of denied boarding due to overbooking, the Passenger shall have the rights established in the pertinent norms of Peruvian and Andean Community legislation applicable to Passengers boarding from/to Peru, and the Colombian regulations applicable to passengers boarding from/to Colombia as the case may be.",
    "chunk_id": "condiciones-generales_p14_c0",
    "content_hash": "10dbed1e82f65ca879b13181f38478f1ff467dabb1674ccb5c3db3571d4206e5",
    "chunk_index": 0,
    "token_count": 283,
    "char_count": 1346,
    "word_count": 202,
    "sentence_count": 8,
    "position_in_doc_percent": 26.72,
    "created_at": "2025-12-26T22:10:01.403647",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 14
  },
  {
    "text": "In the event that the Carrier foresees that they will have to deny boarding, they will have to ask for volunteer Passengers to give up their seats in exchange for certain benefits to be agreed between the volunteers and the Carrier. Voluntary Passengers shall additionally receive assistance in accordance with the provisions of paragraphs a) and e) of the following paragraph, as applicable. If the number of volunteer Passengers is not enough to transport the remaining users who have confirmed a reservation, the Carrier may deny boarding to other Passengers against their will, in which case they must provide compensation, reimbursement and assistance under the terms indicated in the following point. IX.II Right to compensation In the event of cancelations, interruptions or delays in which reimbursement has not taken place, or in the case of any other event attributable to the air carrier, and in the context of overbooking, an alternative transport shall be provided and, if this is not possible, the Passenger shall be compensated in accordance with the following: 1. Delays.",
    "chunk_id": "condiciones-generales_p14_c1",
    "content_hash": "4903001de75ac97976f8ee049491813007cd95c147875a07d8c2328549488cba",
    "chunk_index": 1,
    "token_count": 205,
    "char_count": 1087,
    "word_count": 173,
    "sentence_count": 5,
    "position_in_doc_percent": 27.48,
    "created_at": "2025-12-26T22:10:01.404139",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 14
  },
  {
    "text": "Delays. When there is a delay in the start of the flight (or during take-off) and, therefore, the scheduled time of the authorized flight is not complied with, the following shall be considered: a) When the delay is more than two (2) hours and less than four (4) hours, the Passenger shall be provided with a snack and a free communication by the most appropriate means, equivalent to a telephone call not exceeding three (3) minutes, to the Passenger's chosen destinations.",
    "chunk_id": "condiciones-generales_p14_c2",
    "content_hash": "c3d82cbe69699bd32ba0dbd3a43e771b324b078678c5f2373609f10bab94cc5e",
    "chunk_index": 2,
    "token_count": 102,
    "char_count": 474,
    "word_count": 81,
    "sentence_count": 2,
    "position_in_doc_percent": 28.24,
    "created_at": "2025-12-26T22:10:01.404314",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 14
  },
  {
    "text": "15\nb) When the delay is more than four (4) hours and less than six (6) hours, in addition to the above, the Passenger must be provided with food (breakfast, lunch or dinner, depending on the schedule); and, c) When the delay is more than six (6) hours, in addition to the above, the Carrier must compensate the Passenger in accordance with the provisions of paragraph e) of this numeral. In this case, the Carrier must also provide lodging in cases when overnight stay is necessary, transportation costs, or reimbursement (immediately if they are not in their usual place of residence), at the Passenger's choice, unless the Passenger voluntarily agrees to extend the wait when it is foreseeable that the flight will take place within a reasonable time. 2. Interruption of transport. In the event of interruption of transport, if the Passenger does not opt for the refund of the proportional part of the price corresponding to the leg not covered, they will be compensated for the delay until the restart of the trip, as indicated in paragraph a) above as appropriate. 3. Cancellation. In cases where the Carrier decides to cancel the flight when the Passenger has confirmed reservation, and the net value of the ticket has not been reimbursed or a substitute flight has not been obtained for the same day, the Carrier will cover the costs of accommodation where overnight stay and transfer is necessary.",
    "chunk_id": "condiciones-generales_p15_c0",
    "content_hash": "359a144c80c552fb77ead55099c71f1e61b944a81fa314624fca87123f482af5",
    "chunk_index": 0,
    "token_count": 286,
    "char_count": 1404,
    "word_count": 238,
    "sentence_count": 6,
    "position_in_doc_percent": 29.01,
    "created_at": "2025-12-26T22:10:01.406089",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 15
  },
  {
    "text": "In addition, if there is a delay before the cancelation of the flight, the Passenger will receive the compensation provided in subparagraph a) above, as appropriate. 4. Overbooking. If boarding is denied due to overbooking, and the Passenger has a confirmed reservation and has punctually shown up at the airport, the Carrier must arrange for the Passenger to travel to their final destination on the next flight that has available space from the Carrier itself, on the same date and route. In the event of not having any available flight, the Carrier must make the necessary arrangements on its own behalf, to embark the Passenger on another air carrier as soon as possible. 5. Additional compensation. The Carrier must compensate the Passenger with a minimum amount of 25% of the value of the missing route, payable in cash or in any other form accepted by the Passenger, such as tickets on the routes of the Carrier, vouchers for the purchase of tickets, recognition of miles, etc., in the following cases: a) Overbooking, if there is no direct agreement with the Passenger by which they agree not to travel voluntarily on the scheduled flight. b) Delay of more than six (6) hours of the scheduled time, due to causes attributable to the Carrier. For the purpose of calculating the cost of the journey to be compensated, the net value of the ticket paid shall be multiplied by the ratio of the distance of such journey over the total distance. 6.",
    "chunk_id": "condiciones-generales_p15_c1",
    "content_hash": "a4cdf9f61c249cf621fdfd61c47c8dfa41159958b6c6c959dc1104d984a7200d",
    "chunk_index": 1,
    "token_count": 293,
    "char_count": 1449,
    "word_count": 249,
    "sentence_count": 7,
    "position_in_doc_percent": 29.77,
    "created_at": "2025-12-26T22:10:01.406587",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 15
  },
  {
    "text": "Transit and Connections The above compensations shall also apply as appropriate to Passengers in transit or in connection flights, who cannot continue their trip for reasons attributable to the Carrier.",
    "chunk_id": "condiciones-generales_p15_c2",
    "content_hash": "6209f7d25765f82cf65aad3bde7eb60e3e4511698e501f2b456e1f330b4d5efd",
    "chunk_index": 2,
    "token_count": 35,
    "char_count": 202,
    "word_count": 30,
    "sentence_count": 1,
    "position_in_doc_percent": 30.53,
    "created_at": "2025-12-26T22:10:01.406670",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 15
  },
  {
    "text": "16\nIX.III Endorsement of Air Ticket For domestic flights in Peru, in any mode, Passengers may endorse or transfer the purchased service in favor of a third party that is fully identified. Likewise, Passengers may postpone the contracted flight as agreed, and must give prior and reliable notice to the Carrier no less than twenty-four (24) hours prior to the scheduled date and time of the contracted flight. The Passenger may request these changes through the Contact Center, paying only for the expenses related to the issuance of the new air ticket, which must not exceed the actual cost of such issuance, including the fare difference, if any. In case of delay of the contracted flight, the request for a new date will be subject to the availability of flight and space in the Carrier's aircraft on the requested date. Likewise, if the Passenger purchases round-trip air tickets or air tickets for multiple destinations or segments and is not going to use any of the segments, the Passenger shall have the right to use the following destinations or segments, unless the consumer has another reservation or air ticket for the same route between the dates included in the air ticket which segment the Passenger wishes to maintain, by notifying the Carrier at least twenty-four (24) hours prior to the departure of the first flight. X.",
    "chunk_id": "condiciones-generales_p16_c0",
    "content_hash": "cc65b2d8534857f99fb1d021c4f8bbc3c6d554f9da33cc58ba686c4e65ca54ce",
    "chunk_index": 0,
    "token_count": 260,
    "char_count": 1336,
    "word_count": 225,
    "sentence_count": 6,
    "position_in_doc_percent": 31.3,
    "created_at": "2025-12-26T22:10:01.408450",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 16
  },
  {
    "text": "X. ARGENTINA: PASSENGERS' RIGHTS ACCORDING TO MEYOSP 1532/1998 RESOLUTION, APPLICABLE TO OPERATIONS IN ARGENTINA. X.I Denied boarding and delayed baggage claim In case of denied boarding due to overbooking, the Passenger shall have the rights set forth in the corresponding regulations of the Argentine jurisdiction, applicable to Passengers boarding from/to Argentina and domestic transportation, as the case may be. If due to operational, technical or commercial circumstances, the Carrier cancels or delays a flight or baggage claim for more than FOUR (4) hours, or denies boarding because they cannot provide previously confirmed space (overbooking), or fails to make a stopover at the Passenger's stopover or destination point, or causes a Passenger to miss a connecting flight for which they had a confirmed reservation, the Passenger shall be entitled to: 1. Mandatory placement on the immediate subsequent flight of the same Carrier to their destination, or 2. The endorsement of their transport contract, including confirmed space connections, when it is acceptable for the Passenger, or 3. Be taken on another route to the destination indicated in the contract, on the services of the Carrier or on the services of another carrier, or by another means of transport. In the latter cases, subject to space availability.",
    "chunk_id": "condiciones-generales_p16_c1",
    "content_hash": "5bd875cfd640ac6dd963e22b7a078259e3abe557d95ff554230feec4f6156e0c",
    "chunk_index": 1,
    "token_count": 267,
    "char_count": 1327,
    "word_count": 204,
    "sentence_count": 8,
    "position_in_doc_percent": 32.06,
    "created_at": "2025-12-26T22:10:01.408963",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 16
  },
  {
    "text": "In the latter cases, subject to space availability. If the total of the fare, excess baggage charge, and any other applicable service fee for the new route is higher than the refund value of the ticket or applicable portion of the ticket, the Passenger will not pay any additional fare or charge and the Carrier will refund the difference if the fare and charges for the rescheduled route are lower:",
    "chunk_id": "condiciones-generales_p16_c2",
    "content_hash": "0e7ba9485f3f4c7ad3cbe52def14ede5089044deba40bc423d66fab78dbe726e",
    "chunk_index": 2,
    "token_count": 77,
    "char_count": 399,
    "word_count": 70,
    "sentence_count": 2,
    "position_in_doc_percent": 32.82,
    "created_at": "2025-12-26T22:10:01.409083",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 16
  },
  {
    "text": "17\n1. Compensation for denied boarding according to Carrier regulations, 2. the immediate refund, if applicable, of the price of the unused transport contract, in accordance with the payment methods used. Those Passengers who voluntarily and expressly accept the compensation for denied boarding and to engage in transport under any of the conditions detailed in this paragraph, shall not be entitled to make any subsequent claim to the Carrier, without prejudice to being benefited with the incidental services provided by the Carrier at their expense in this situation. In addition, the Carrier shall provide the Passenger with the following incidental services free of charge: 1. Telephone or cable communication to the destination point and local communications. 2. Meals and snacks according to the waiting time until boarding another flight. 3. Hotel, airport or city accommodation when the delay of a flight exceeds FOUR (4) hours. 4. Ground transportation to and from the airport. The Carrier shall be exempt from providing the above-mentioned incidental services to its Passengers in cases where, as a result of weather conditions, the flight is canceled or delayed, baggage delivery is delayed, a stopover cannot be made at the Passenger's stopover or destination point, or a connecting flight for which a confirmed reservation was made is missed.",
    "chunk_id": "condiciones-generales_p17_c0",
    "content_hash": "c3c86e741d2ee6e970c8c8e46a2586a68b9d035aa239439c69a3f7b0acb2a9b6",
    "chunk_index": 0,
    "token_count": 253,
    "char_count": 1357,
    "word_count": 211,
    "sentence_count": 9,
    "position_in_doc_percent": 33.59,
    "created_at": "2025-12-26T22:10:01.410756",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 17
  },
  {
    "text": "However, in such cases, the Carrier shall make every effort to ensure that the Passenger is adequately and truthfully informed of the delays caused by such circumstances until the service is provided or resumed or re-routed through the services of another Carrier or alternative means of transport. X.II Information on Argentina's aeronautical authority for user complaints related to air transportation. Información sobre autoridad aeronáutica Argentina para reclamos de usuarios de transporte aéreo. To file a complaint with the aeronautical authority of the Republic of Argentina, please click here: http://www.anac.gov.ar/anac/web/index.php/2/396/reclamos-transp-aereo/reclamos X.III Right to withdrawal doesn’t apply For purchases through JetSMART.com and the Contact Center, the right of withdrawal established in Article 34 of Law No. 24.240 does not apply (in accordance with the provisions of Article 63 of Law 24.240, Article 2 of the Aeronautical Code and Article 10 paragraph a) second paragraph of Annex I of Resolution MEOySP 1532/1998). X.IV For domestic transportation in the Argentine Republic, the rules of the Argentine Aeronautical Code and Resolution 1532/1998 of the MEyOySP shall be exclusively applicable, without exception. XI.",
    "chunk_id": "condiciones-generales_p17_c1",
    "content_hash": "3e7351b0249cf34bc267b6d183ad910c3280763f126c24381830331d1ee63abf",
    "chunk_index": 1,
    "token_count": 276,
    "char_count": 1252,
    "word_count": 177,
    "sentence_count": 6,
    "position_in_doc_percent": 34.35,
    "created_at": "2025-12-26T22:10:01.411299",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 17
  },
  {
    "text": "XI. BRAZIL: PASSENGERS’ RIGHTS ACCORDING TO THE AIR LEGISLATION REGULATING AIR TRANSPORT IN BRAZIL: FEDERAL CONSTITUTION, BRAZILIAN AIRCRAFT CODE, CIVIL CODE, CONSUMER PROTECTION CODE AND ANAC (NATIONAL AGENCY NATIONAL AGENCY) RESOLUTIONS",
    "chunk_id": "condiciones-generales_p17_c2",
    "content_hash": "e93f8abd4ed0e86ef1be46a63872b53b215e9667adb242093518071f61b5203c",
    "chunk_index": 2,
    "token_count": 74,
    "char_count": 238,
    "word_count": 31,
    "sentence_count": 2,
    "position_in_doc_percent": 35.11,
    "created_at": "2025-12-26T22:10:01.411410",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 17
  },
  {
    "text": "18\nCurrently in Brazil, in addition to the specific provisions that apply to national air transport (within the Brazilian national territory), established in the rules mentioned above, we highlight the rules that refer to the \"General Conditions of Air Transport\", regulated by the Resolution No. 400/2016 and No. 280 of the National Civil Aviation Agency - ANAC. Air transport is also governed by the Montreal Convention (Decree 5910/2006). These rules define the new rights and duties of air Passengers and consolidate the relevant regulations. Below, the main rules applicable to air transport in Brazil are presented: XI. I Obligations prior to air transport 1. Information regarding the flight offer The company must inform in detail, in Portuguese, to allow the Passenger to understand immediately, easily and clearly all the services they offer and also clarify: a) The total amount (ticket price and taxes) to be paid in national currency, as well as the final amount; b) All transport rules, as well as the cancellation and modification of the contract with possible penalty; c) Time of stopover and connection and eventual change of airports; and d) Baggage allowance rules sent and the amount to be paid in case of excess baggage The carrier will offer the Passenger at least one ticket option in which the fine for reimbursement or change of reservation does not exceed 5% of the total value of air transport services 2. Air ticket receipt.",
    "chunk_id": "condiciones-generales_p18_c0",
    "content_hash": "d0f76cca9c0621cc5790489f7cefc04fa1eb52f4d9fb98d0b8c1ad5d6fff3303",
    "chunk_index": 0,
    "token_count": 292,
    "char_count": 1452,
    "word_count": 237,
    "sentence_count": 7,
    "position_in_doc_percent": 35.88,
    "created_at": "2025-12-26T22:10:01.413043",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 18
  },
  {
    "text": "Air ticket receipt. The airline must present to the Passenger a proof of purchase that contains: name and surname of the Passenger, date and time of flight, procedure and time of boarding, products and services purchased and validity of the ticket (if it is within a period of one year). 3. Correction of name in the air ticket The error in the name or surname must be corrected by the airline without charge, at the request of the Passenger, if the Passenger requests this until the time of check-in. In case of an error in the name on an international interline flight (provided by more than one airline), the correction costs can be transferred to the Passenger. 4. Breach of contract by the Passenger It is forbidden to charge a fine in excess of the ticket amount, and airport fees cannot be part of the calculation of the fine. In case of reprogramming the ticket, the Passenger must pay or receive: the variation of the airport fare (if applicable); and the difference between the value of the services at the time of hiring and the amount offered at the time of reprogramming. 5. Right to withdraw the purchase of the ticket The Passenger may withdraw the purchase of the ticket within 24 hours after reception of the air ticket receipt, free of charge, provided that the purchase occurs more than 7 days before the date of boarding.",
    "chunk_id": "condiciones-generales_p18_c1",
    "content_hash": "e4a44822773b56c3c5dbce7ca4f4010f169e03f3303f90a53e058fcf981de2c8",
    "chunk_index": 1,
    "token_count": 273,
    "char_count": 1341,
    "word_count": 237,
    "sentence_count": 7,
    "position_in_doc_percent": 36.64,
    "created_at": "2025-12-26T22:10:01.413550",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 18
  },
  {
    "text": "19\n6. Change scheduled by the Carrier Scheduled changes must always be informed to Passengers as soon as the company knows about them and at least 72 hours before the flight. When the time change occurs with less than 72 hours of flight time or more than 30 minutes (domestic flights) and 1 hour (international flights) from the originally booked time and the Passenger does not agree, the airline must offer relocation in a similar Carrier without charge or a full refund. If the airline does not notify in time to prevent the Passenger from showing up at the airport, they will provide material assistance by offering the following options: accommodation, full reimbursement and provision of the service by other means of transport. 7. Baggage allowance For dispatched luggage, franchises are released. As for hand luggage, the carrier must allow a minimum franchise of 10 kilos. The carrier will inform Passengers which baggage will be subject to special clearance procedures and baggage that does not fit may be rejected or subject to a cargo contract. Freight and animal transport must follow their own contracting regime and clearance procedures. XI.II Execution of Air Transport 1. Boarding documents. a) If the Passenger is Brazilian: i. On domestic flights, the Passenger can present any official document that allows identification. Certified copies of the documents are accepted. ii. On international flights for Brazilians, a valid Brazilian passport must be presented.",
    "chunk_id": "condiciones-generales_p19_c0",
    "content_hash": "b65a8913b5f11f1cfa9746c7e029af7871c8695726fff2a685e2e294e9c12527",
    "chunk_index": 0,
    "token_count": 283,
    "char_count": 1481,
    "word_count": 236,
    "sentence_count": 13,
    "position_in_doc_percent": 37.4,
    "created_at": "2025-12-26T22:10:01.415070",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 19
  },
  {
    "text": "Certified copies of the documents are accepted. ii. On international flights for Brazilians, a valid Brazilian passport must be presented. In the case of trips to Argentina, Uruguay, Paraguay, Bolivia, Chile, Peru, Ecuador, Colombia and Venezuela, the Civil Identity Card (RG) issued by the Secretariats of Public Security of the State or of the federal District is also accepted as a travel document. b) Foreigner Passengers i. Domestic flights require a passport or foreign identity card - CIE (RNE). The diplomatic or consular identity or any other legal travel document is also accepted in accordance with Decree No. 5.978/2006 or as a result of international agreements signed by Brazil. ii. On international flights, a passport or civil identity card (GR) is mandatory for citizens of Mercosur countries. In case of loss or theft of documents, children and adolescents, please visit: https://www.anac.gov.br/assuntos/passageiros/novas-regras/documentos-para-embarque. 2. Special baggage value declaration procedure",
    "chunk_id": "condiciones-generales_p19_c1",
    "content_hash": "6d250a61dc2a91e8239cc4d8c45ad05a45652508cb2a7c1a1f7556bc96fbe48c",
    "chunk_index": 1,
    "token_count": 223,
    "char_count": 1020,
    "word_count": 147,
    "sentence_count": 8,
    "position_in_doc_percent": 38.17,
    "created_at": "2025-12-26T22:10:01.415447",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 19
  },
  {
    "text": "20\nThe Passenger must inform the carrier if he carries in the dispatched luggage goods that exceed the value greater than 1,131 SDR (Special Drawing Rights). In this case, the company can charge the Passenger the payment of an additional amount or insurance. 3. Passenger’s obligations. For the execution of air transport, The Passenger has the obligation to: a) Show for boarding with all the required documentation and at the time established by the Carrier; b) Comply with all requirements related to transportation, such as obtaining a visa, vaccination certificates, etc. c) Follow the Carrier’s notices. 4. Prohibition of automatic cancellation of the return leg. In international transport, if the Passenger does not use the initial leg, the Carrier can cancel the return leg. In national transport, the non-assistance of the Passenger in the first leg of a round trip flight will not result in the automatic cancellation of the return leg, provided that the Passenger notifies the airline of the 'no show' until the scheduled time originally from the outbound flight. 5. Delay, cancellation and interruption of services The carrier must immediately inform the Passenger through the available means of communication about delays, cancellations and interruptions of the service. The airline must also keep the Passenger informed, at most, every 30 (thirty) minutes of the scheduled flight departure time in case of delay.",
    "chunk_id": "condiciones-generales_p20_c0",
    "content_hash": "bb89b12d6cee17f7ecc5fc77e8c8debcf66246ce1c156c7a606dbe46a0eef35f",
    "chunk_index": 0,
    "token_count": 277,
    "char_count": 1427,
    "word_count": 224,
    "sentence_count": 9,
    "position_in_doc_percent": 38.93,
    "created_at": "2025-12-26T22:10:01.417089",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 20
  },
  {
    "text": "Information on the reason for the delay, cancellation, interruption of the service and the denial will be provided in writing by the Carrier whenever requested by the Passenger. The Carrier will offer the alternatives of accommodation, reimbursement and provision of the service by other means of transport, and the Passenger must choose, in the following cases: flight delay of more than four hours from the schedule originally agreed; flight cancellation or service interruption; denied boarding to Passengers; and the subsequent missed flight by the Passenger on connecting flights, including the change of airport, when the responsible for these missed flights is the Carrier. 6. Financial compensation in case of denied boarding (overbooking) Whenever the number of Passengers for the flight exceeds the availability of seats in the aircraft, the airline will seek volunteers to be accommodated on another flight after the negotiated compensation between the volunteer Passenger and the airline, and the airline may condition the payment of the Compensation to signing a specific acceptance document. The rearrangement of volunteer Passengers on another flight when accepting compensation will not constitute denied boarding. If there is no consensus between the airline and the Passenger who showed up at the scheduled time and was denied boarding, the airline must immediately make the payment of the financial compensation to the Passenger, which can be done by bank transfer, voucher or cash, 250 SDR (Special Drawing Rights) for domestic flights and 500 SDR (Special Drawing",
    "chunk_id": "condiciones-generales_p20_c1",
    "content_hash": "0869871c7d6d71b68d589253f1b99419cf11772c604d843b596080e340bc9407",
    "chunk_index": 1,
    "token_count": 279,
    "char_count": 1584,
    "word_count": 241,
    "sentence_count": 5,
    "position_in_doc_percent": 39.69,
    "created_at": "2025-12-26T22:10:01.417527",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 20
  },
  {
    "text": "21\nRights) for international flights, in addition to the provision of other assistance provided for in the rules that govern. 7. Material assistance In cases of delay, cancellation, interruption of service or denied boarding to Passengers, the airline must provide material assistance to the Passenger, which consists of: right to communicate after one hour of delay, food, after two hours of delay, and following alternatives, after four hours of delay, at the Passenger's choice: accommodation, full reimbursement or provision of the service by another means of transport. In the case of a Passenger in Need of Special Assistance - PNAE and its companions (Resolution 280 of 2013), material assistance will be provided regardless of the overnight requirement, unless it can be replaced by accommodation in a place that meets their needs and with the agreement of the Passenger or companion. The right to material assistance cannot be suspended in cases of force majeure or unforeseen event. However, the Carrier can stop offering accommodation service to the Passenger who resides in the city of the airport of origin, guaranteeing a round trip transfer. The airline can also stop providing material assistance when the Passenger decides to redeem the flight of the airline which will be on the date and time at the Passenger's convenience, or reimburse the entire air ticket. 8.",
    "chunk_id": "condiciones-generales_p21_c0",
    "content_hash": "26d60dacf7d0d3f265cb10a969965c76d343f92df27a10b6c419a6ee68c8e06b",
    "chunk_index": 0,
    "token_count": 263,
    "char_count": 1381,
    "word_count": 220,
    "sentence_count": 6,
    "position_in_doc_percent": 40.46,
    "created_at": "2025-12-26T22:10:01.419096",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 21
  },
  {
    "text": "Rearrangement The rearrangement will be free, will not cancel the transport contracts already signed and will have priority over the conclusion of new transport contracts, and must be carried out at the Passenger's choice as follows: (1) on their own or third party flights to the same destination as soon as possible; or (2) on the airline's own flight that will take place at the Passenger's date and time of convenience. Passengers in Need of Special Assistance: PNAE (and their companions) will have priority in rearrangement. 9. Deadline for reimbursement The air ticket reimbursement must comply with the payment methods used to purchase the air ticket and also the following: a) In cases of reimbursement, airport charges and amounts paid to government entities will be fully reimbursed. b) For cash purchases, the refund must be made within 7 days; c) For purchases with a credit card, the company will have 7 days to start the reimbursement process through the credit card companies; d) For purchases through a travel agency, the airline will be responsible for authorizing the remaining credit of the ticket within 7 days after the request for a refund, which will begin with the travel agent's notice. In case of flight delay, flight cancellation, interruption of service or denied boarding to the Passenger, the refund will be given as follows: total, if requested at the airport of origin,",
    "chunk_id": "condiciones-generales_p21_c1",
    "content_hash": "e1eb8ac2660d8ab75d7e4d50f20d245154ed0de52f4b3ac6ed2560b2a9c11651",
    "chunk_index": 1,
    "token_count": 282,
    "char_count": 1402,
    "word_count": 230,
    "sentence_count": 4,
    "position_in_doc_percent": 41.22,
    "created_at": "2025-12-26T22:10:01.419500",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 21
  },
  {
    "text": "22\nstopover or connection, ensuring, in these last two (2) cases, the return to the airport of origin; proportional to the unused section, if the trip already completed is beneficial to the Passenger. The reimbursement can be given in the form of credits for the purchase of air tickets, through the agreement of the Passenger and the credit and its validity will be informed to the Passenger in writing. The free use of the credit must be guaranteed, even for the purchase of air tickets for third parties. XI.III Obligations after air transport 1. Provisions in case of loss, damage and violation of baggage. Receipt of checked baggage, without receiving the Passenger’s complaint, will constitute a presumption that it has been delivered in good condition. In the event luggage is lost, the Passenger must immediately file a complaint. In cases where the Passenger finds the violation of the contents of the luggage or its malfunction, he must file a complaint to the Carrier within 7 (seven) days after the baggage claim. The deadline to return lost luggage at the place indicated by the Passenger is 7 days on a national flight and 21 days on an international flight. If the airline does not find the luggage within the specified time, they will have up to 7 days to pay the due compensation to the Passenger.",
    "chunk_id": "condiciones-generales_p22_c0",
    "content_hash": "3df6bece532db20d0dfcdc2a30641ace79fb876e035594627b032ecab46d064b",
    "chunk_index": 0,
    "token_count": 265,
    "char_count": 1314,
    "word_count": 225,
    "sentence_count": 10,
    "position_in_doc_percent": 41.98,
    "created_at": "2025-12-26T22:10:01.421104",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 22
  },
  {
    "text": "If the airline does not find the luggage within the specified time, they will have up to 7 days to pay the due compensation to the Passenger. The Carrier must, within seven (7) days from the date of the complaint, take one of the following measures, as appropriate: repair the damage caused, when possible; replace damaged luggage with another equivalent; compensate the Passenger in case of violation. In case of lost luggage, the reimbursement of eventual expenses will be given to the Passenger who is outside their home, within 7 (seven) days after the presentation of proof of expenses. The contractual rules must establish the form and daily limits of reimbursement, and if the luggage is not found: I - the reimbursement of expenses can be deducted from the amounts paid as final compensation (subject to the limit of 1,288 SDR); II - the Carrier will reimburse the Passenger for any additional amount eventually paid for the transport of luggage. The carrier may offer reimbursement credits and reimbursement services at the Passenger's discretion. Damage caused to a shipped fragile item may not be compensated by the Carrier, as stipulated in the transport contract. 2. Attention to Passengers The airline must make available to the user at least one electronic service channel to receive complaints, request information, contractual alteration, cancellation and refund.",
    "chunk_id": "condiciones-generales_p22_c1",
    "content_hash": "3342e7b83b97977d2e5f05e03d9f213c6835942efa2e6e609e82643f185f826c",
    "chunk_index": 1,
    "token_count": 261,
    "char_count": 1380,
    "word_count": 221,
    "sentence_count": 7,
    "position_in_doc_percent": 42.75,
    "created_at": "2025-12-26T22:10:01.421549",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 22
  },
  {
    "text": "The carrier that registers less than 1,000,000 (one million) Passengers transported in the previous year may continue to operate the Customer Service Center (SAC for its acronym in Portuguese) for telephone service on the days it operates flights in Brazil and during business hours.",
    "chunk_id": "condiciones-generales_p22_c2",
    "content_hash": "0b4bf990213f7c11cb83465dfdc0497cfdeb023eb81572b1a97593c690020617",
    "chunk_index": 2,
    "token_count": 56,
    "char_count": 283,
    "word_count": 44,
    "sentence_count": 1,
    "position_in_doc_percent": 43.51,
    "created_at": "2025-12-26T22:10:01.421640",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 22
  },
  {
    "text": "23\nThe airline will provide a face-to-face service at the airport to respond to requests for information, questions and complaints from users, as well as their obligations arising from flight delay, flight cancellation, service interruption and Passenger’s denied boarding. This attention can be carried out in a separate and duly identified place or in the check-in sector at the discretion of the Carrier, and will operate for at least 2 (two) hours before each takeoff and 2 (two) hours after each landing; This will remain available as long as there is an operation and a need in cases of flight delay, flight cancellation, service interruption and Passenger’s denied boarding. The information requested by the Passenger must be provided immediately and their complaints must be resolved within a maximum period of ten (10) days from the registration, subject to the specific deadlines contained in current legislation. The airline must respond, within (ten) days, the user's statements sent by the electronic service system adopted by ANAC - www.consumidor.gov.br. XII. COLOMBIA: PROVISIONS APPLICABLE TO PASSENGERS OPERATING IN COLOMBIA UNDER THE AERONAUTICAL REGULATIONS OF COLOMBIA. XII.I Presentation of Passenger at the airport The Passenger must show up at the departure airport and check in within the time indicated by the Company at the time of purchase of the ticket or the reservation.",
    "chunk_id": "condiciones-generales_p23_c0",
    "content_hash": "c56af1fb5e5f9599dae92591178675d5f4018c8c468508ace1229325595ca8ee",
    "chunk_index": 0,
    "token_count": 285,
    "char_count": 1401,
    "word_count": 218,
    "sentence_count": 7,
    "position_in_doc_percent": 44.27,
    "created_at": "2025-12-26T22:10:01.423305",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 23
  },
  {
    "text": "In the absence of such indication, they have to do so at least one (1) hour prior to the departure of domestic flights and two (2) hours prior to the departure of international flights; these times shall be doubled during high season periods. Denied boarding and Limitations on Transportation Without prejudice to other circumstances established by the Company in accordance with the applicable regulations, the transportation of a Passenger may be denied or limited when: 1. The Passenger is in a mental or physical health condition that according to the airline's judgment may pose a risk to the Passenger, other Passengers, crew or property. 2. The Passenger has resisted to undergo a security check. 3. The Passenger has not paid the fare, taxes, fees, applicable contributions, additional services or other costs and expenses they are obliged to pay. 4. The Passenger fails to provide the required travel and identification documents, destroys their documents during the trip or refuses to hand them over to the airline personnel or the competent authorities, when required to do so. 5. The Passenger presents a Ticket: (i) purchased against the law and these provisions; and (ii) that has been purchased through a person not authorized by the Airline; (iii) that has been issued or modified by someone other than the Airline or without the Airline's authorization. 6.",
    "chunk_id": "condiciones-generales_p23_c1",
    "content_hash": "25f80b78ec1ce86c8a8e0f6e88ee9cafeea86ee6c97009b24c7c64b7ae5c08bb",
    "chunk_index": 1,
    "token_count": 272,
    "char_count": 1373,
    "word_count": 222,
    "sentence_count": 7,
    "position_in_doc_percent": 45.04,
    "created_at": "2025-12-26T22:10:01.423751",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 23
  },
  {
    "text": "The Passenger cannot prove by means of a valid photo ID that he/she is the person whose name appears on the Ticket. 7. Safety measures, provisions or filters determined by the airport are violated.",
    "chunk_id": "condiciones-generales_p23_c2",
    "content_hash": "2cc776cbc5536882fceb87530629d8a8bc3c78c949e6cbb5b98d2625c2493772",
    "chunk_index": 2,
    "token_count": 40,
    "char_count": 197,
    "word_count": 34,
    "sentence_count": 2,
    "position_in_doc_percent": 45.8,
    "created_at": "2025-12-26T22:10:01.423881",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 23
  },
  {
    "text": "24\n8. The Passenger fails to comply with the airline's security checkpoints and/or causes forced access to the aircraft. 9. The transport of minors in incubators is not permitted. In exercise of this discretionary right, the Company may refuse to provide the transportation service and shall not be liable for any expenses incurred by the Passenger as a result. If a Passenger is denied boarding for any of the reasons mentioned in this section, the Ticket price will not be refunded, except as provided in the applicable regulations. XII.III Reimbursements There will be reimbursement or other compensation, according to the conditions and terms established by the Company in accordance with the applicable legal framework in the event that due to JetSMART's responsibility the flight cannot start or must be suspended after having started, due to delays, cancellations or diversion of the flight. 1. When a Passenger of the Company dies before the start of the trip, full reimbursement will be made as long as JetSMART is able to prove it. 2. The Passenger must take into account that: (i) there are Promotional Fares that do not allow Ticket reimbursement. 3.",
    "chunk_id": "condiciones-generales_p24_c0",
    "content_hash": "ce5e14758bd866dd0c1115de19e7a2f711ed800d80e83acca033654528d072d9",
    "chunk_index": 0,
    "token_count": 231,
    "char_count": 1162,
    "word_count": 190,
    "sentence_count": 8,
    "position_in_doc_percent": 46.56,
    "created_at": "2025-12-26T22:10:01.426165",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 24
  },
  {
    "text": "The Passenger must take into account that: (i) there are Promotional Fares that do not allow Ticket reimbursement. 3. Right to withdrawal: When services have been purchased with the airline through financing systems granted by the producer or supplier, sale of timeshares or sales using non-traditional or remote methods, which have not begun to be executed before five (5) days, the consumer may withdraw from the purchase within five (5) business days following the purchase. 4. Withdrawal: The Passenger may cancel the trip up to 24 hours before the beginning of the trip, as long as the Contract of Transport originates in Colombia. The Carrier may retain up to 10% of the value of the fare, excluding fees, taxes and administrative fee. The foregoing shall not apply in the case of Promotional Fares. 5. Withdrawal shall not apply for Promotional Fares. XIII. URUGUAY: PASSENGERS RIGHTS ACCORDING TO THE URUGUAYAN AERONAUTICAL CODE AND THE REGULATIONS APPLICABLE TO OPERATIONS XIII.I. Denied boarding due to overbooking In case of denied boarding due to overbooking, the Passenger shall have the rights established in the Uruguayan Aeronautical Code, the Montreal Convention (Law 18.169) and other relevant provisions.",
    "chunk_id": "condiciones-generales_p24_c1",
    "content_hash": "9f3aa6f4df3061e6e4e45ffcf6521c7dffceb73e5af4fc8dac2c5c2e2b1fe3fd",
    "chunk_index": 1,
    "token_count": 274,
    "char_count": 1223,
    "word_count": 192,
    "sentence_count": 9,
    "position_in_doc_percent": 47.33,
    "created_at": "2025-12-26T22:10:01.426692",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 24
  },
  {
    "text": "Other Passengers' rights and obligations, JetSMART Airlines' limits of liability and general conditions of the air transportation contract, which are informed and accepted at the time of purchase and which are part of the Ticket, can be downloaded and printed at: https://jetsmart.com/cl/es/tyc/condiciones-generales.",
    "chunk_id": "condiciones-generales_p24_c2",
    "content_hash": "9ee48244de0e0e384050e00655a8b10e08b9107140ec535749959dcb45faffdb",
    "chunk_index": 2,
    "token_count": 66,
    "char_count": 317,
    "word_count": 42,
    "sentence_count": 1,
    "position_in_doc_percent": 48.09,
    "created_at": "2025-12-26T22:10:01.426809",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 24
  },
  {
    "text": "25\nIn the event that the Carrier foresees that they will have to deny boarding to one or more Passengers who have shown up in a timely manner and whose Ticket was previously confirmed on a given flight due to overbooking, they must first request that volunteers show up to give up their reservations in exchange for certain benefits and compensation to be agreed between the volunteers and the Carrier. If there are not enough volunteers to give up their seats so that the remaining Passengers holding a confirmed ticket can board the corresponding flight, the Carrier can deny boarding to one or more Passengers against their will. These Passengers will have the right to: 1. Passenger's choice: a) Board the next available flight provided by the carrier, or in an alternative transport, if they decide to persist in the air carriage contract; b) To receive reimbursement of the full amount paid for the ticket if the Passenger withdraws from the air transportation contract only if the trip has not begun; or c) If the trip with stopovers and/or connections had already started, the Passenger can choose to: i. Board the next available flight provided by the carrier, or in an alternative transport, if they decide to persist in the air carriage contract; ii. Receive a refund of the unused part; or iii. Return to the starting point and receive reimbursement of the ticket price. 2.",
    "chunk_id": "condiciones-generales_p25_c0",
    "content_hash": "2ab7116d1d214f8f2343fb477189419fd70a43717b2869b5b92eb135a46d6a4a",
    "chunk_index": 0,
    "token_count": 275,
    "char_count": 1385,
    "word_count": 236,
    "sentence_count": 7,
    "position_in_doc_percent": 48.85,
    "created_at": "2025-12-26T22:10:01.428464",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 25
  },
  {
    "text": "Receive a refund of the unused part; or iii. Return to the starting point and receive reimbursement of the ticket price. 2. On international flights, to receive compensation of an amount limited to 5,346 Special Drawing Rights (from the International Monetary Fund) per Passenger, as stipulated in the Montreal Convention (Law 18,169) and applicable regulations. Such limit shall not apply if it is proved that the damage is the result of an act or omission of the Carrier or its employees or agents, with intent to cause damage, or recklessly and knowing that it would probably cause harm; provided that, in the case of an act or omission of an employee or agent, it is also proved that they acted in the exercise of their functions. The compensation shall not apply if the Carrier proves that they, their employees and agents took all the reasonably necessary measures to avoid the event causing the delay, or that such measures were impossible for the Carrier, their employees or the agents to take.",
    "chunk_id": "condiciones-generales_p25_c1",
    "content_hash": "7ebdec0005aba0f8a3c0b931b9037320487c8358c1eac400265f1f349ec2dd5d",
    "chunk_index": 1,
    "token_count": 200,
    "char_count": 1002,
    "word_count": 170,
    "sentence_count": 5,
    "position_in_doc_percent": 49.62,
    "created_at": "2025-12-26T22:10:01.428859",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 25
  },
  {
    "text": "Regarding the above compensations, Passengers must keep in mind: a) A Passenger who accepts such compensation may not subsequently take any action against the Carrier for the same act. b) If, in accordance with the provisions of 1a of point 1 above, the Passenger is embarked on the next flight the Carrier has available, and the difference in departure time with respect to the flight originally booked is not more than three hours, no compensation shall be granted for denied boarding.",
    "chunk_id": "condiciones-generales_p25_c2",
    "content_hash": "c2ff511045b629cb01e1dbff30b4fc7fadaffc39417c023452b947b14e2cf44a",
    "chunk_index": 2,
    "token_count": 96,
    "char_count": 487,
    "word_count": 81,
    "sentence_count": 1,
    "position_in_doc_percent": 50.38,
    "created_at": "2025-12-26T22:10:01.428998",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 25
  },
  {
    "text": "26\n3. If the Passenger decides to continue with the contract in the event of denied boarding, they shall be entitled to receive the following assistance from the Carrier: a) Communications that the Passenger needs to make, whether by telephone, electronic or other similar means, if there is a difference of more than four hours in the scheduled time of departure for the flight initially booked; b) Meals and snacks until boarding of the other flight, if there is a difference in the scheduled departure time of the originally booked flight of more than four hours; c) Accommodation for return and outbound Passengers who were denied boarding at a connecting point, who do not reside in the city, town or area of the departure airport, in the event that they are offered a new flight, of which the departure is at least on the day following the scheduled departure on the Ticket, provided that the Passenger must stay one or more nights, and the waiting time to board the other flight requires it. For these purposes, \"night\" shall be defined as the time between midnight to 6 a.m.; d) Transfer from the airport to the Passenger's place of residence in the city, town or area surrounding the departure airport, or to the place of accommodation, and back again, if applicable; and e) The necessary arrangements and services to continue the trip, in case the Passenger misses a connecting flight that has been confirmed.",
    "chunk_id": "condiciones-generales_p26_c0",
    "content_hash": "50a3f818ce58e9c6fa0f905c5a98eae8c971048c02beb417b50564b4db0a5f3c",
    "chunk_index": 0,
    "token_count": 281,
    "char_count": 1419,
    "word_count": 243,
    "sentence_count": 3,
    "position_in_doc_percent": 51.15,
    "created_at": "2025-12-26T22:10:01.430836",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 26
  },
  {
    "text": "For the purposes of this section, a Ticket shall be considered as confirmed, with respect to the points of departure and destination indicated therein, including intermediate points of connection or stopover, to the extent that it is established that the reservation or the Ticket has been accepted and registered by the Air Carrier or its authorized agent. “Stopover and/or connecting journey\" is understood as a journey which includes a point of departure and one or more intermediate points of stopover and/or connection on arrival at the destination, when these are part of the same contract. Without prejudice to other additional services that the Carrier may offer, depending on the circumstances and the special condition of the Passenger, in the event of denied boarding the Carrier shall embark, as a priority, unaccompanied children, people with disabilities, elderly or health-sensitive Passengers, pregnant women who, due to their condition, require preferential boarding and, in general, Passengers who, for humanitarian reasons qualified by the Carrier, must be embarked first. XIII.II Delays and cancelations The Carrier is required to comply with transporting Passengers on the date, schedule and other agreed terms and conditions. However, the Carrier can suspend, delay and cancel the flight or modify these terms and conditions on grounds of force majeure or for safety reasons such as bad weather, armed conflicts, civil unrest or threats against the aircraft.",
    "chunk_id": "condiciones-generales_p26_c1",
    "content_hash": "c3c15908759710af5dd1db6be3447f0b76d111cd648db49162036a416a2ec806",
    "chunk_index": 1,
    "token_count": 274,
    "char_count": 1480,
    "word_count": 226,
    "sentence_count": 4,
    "position_in_doc_percent": 51.91,
    "created_at": "2025-12-26T22:10:01.431293",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 26
  },
  {
    "text": "In such cases, any of the contracting parties may rescind the contract, being each one responsible for their own losses. Notwithstanding the foregoing, in the event of delay or cancellation of a flight, the affected Passenger shall have the rights conferred by the regulations in force and in any case, the Carrier's",
    "chunk_id": "condiciones-generales_p26_c2",
    "content_hash": "f245467d6567080f81ebd4a03b09c5acae297745484aad9a315e0e27b752afc1",
    "chunk_index": 2,
    "token_count": 61,
    "char_count": 316,
    "word_count": 52,
    "sentence_count": 2,
    "position_in_doc_percent": 52.67,
    "created_at": "2025-12-26T22:10:01.431431",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 26
  },
  {
    "text": "27\nliability shall be limited to 5,346 Special Drawing Rights (of the International Monetary Fund) per Passenger, as stipulated in the Montreal Convention (Law 18,169) and applicable regulations. The compensation shall not apply if the Carrier proves that they, their employees and agents took all the reasonably necessary measures to avoid the event causing the delay, or that such measures were impossible for the Carrier, their employees or the agents to take. XIV. EMERGENCY CONDITIONS DUE TO COVID-19 In order to protect the safety of our Passengers and crew, in view of the worldwide pandemic caused by the outbreak of the COVID-19 virus, and in exercise of the powers conferred by the applicable law and the competent authorities, the Carrier informs its customers and Passengers that boarding of its flights will be subject to compliance with the measures issued by the health and aviation authorities, and boarding may be denied in the event of non-compliance with such measures or the Passenger's refusal to declare or prove compliance, in accordance with the law.",
    "chunk_id": "condiciones-generales_p27_c0",
    "content_hash": "743463e139159ac2c6ae1266db8f78089906df71998abe98f5170d3bc4063b44",
    "chunk_index": 0,
    "token_count": 210,
    "char_count": 1074,
    "word_count": 172,
    "sentence_count": 4,
    "position_in_doc_percent": 53.44,
    "created_at": "2025-12-26T22:10:01.433441",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 27
  },
  {
    "text": "The Carrier shall demand from the Passengers the mandatory use of masks during the entire flight, including boarding and exiting, the subscription of declarations and/or the extension of supporting documentation to prove that the transportation of the Passenger does not constitute a risk of transmission of the aforementioned virus in those cases where applicable and/or any other measure that may be necessary and conducive to ensure the safety and hygiene of its Passengers and crew, under the terms and conditions permitted under the applicable law.",
    "chunk_id": "condiciones-generales_p27_c1",
    "content_hash": "bbbb7014890ab513e155e9fc01a8246f8208aac10d67551c3caf04c92f9481e1",
    "chunk_index": 1,
    "token_count": 93,
    "char_count": 553,
    "word_count": 85,
    "sentence_count": 1,
    "position_in_doc_percent": 54.2,
    "created_at": "2025-12-26T22:10:01.433856",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 27
  },
  {
    "text": "In consideration of the foregoing, the Carrier may deny transportation on any of the legs of the itinerary contracted by the Passenger, to those who: (i) show symptoms suggesting probable infection by COVID-19 as reported by health authorities, such as fever over 37.8°, cough, shortness of breath, headache and / or sore throat, unless they prove through a medical certificate or in the way stipulated in the applicable law that such symptoms are not caused by a COVID-19 infection; and/or (ii) do not provide the following affidavit at the check-in process of each leg of their flight, either personally or by their representative or agent, or it is determined that the declaration is not effective: \"I declare that all Passengers on this reservation: (i) are not subject to any sanitary restriction that implies isolation or quarantine, prohibition of movement, or restriction of entry to, or exit from, a territory included in the trip, or that being subject to any of said measures, they have all the temporary or permanent permits that may be necessary to move, issued by the competent authority; (ii) are not confirmed COVID-19 patients, or having been confirmed, meet the criteria established by the health authority to be considered patients without risk of infection; (iii) are not awaiting COVID-19 test results; (iv) have not been in close contact with a person diagnosed with COVID-19, or having been, have ruled out the disease in the manner established by the competent authority; and (v) have reviewed and become aware of the restrictions, requirements and information available in the COVID-19 section of JetSMART. com https://jetsmart.com/cl/es/minisitios/covid-19#seccion-2.",
    "chunk_id": "condiciones-generales_p27_c2",
    "content_hash": "f363bc6f951c19cc0961907daf306e3e242fa4cb0ab26032d324253e722f7f91",
    "chunk_index": 2,
    "token_count": 352,
    "char_count": 1693,
    "word_count": 265,
    "sentence_count": 1,
    "position_in_doc_percent": 54.96,
    "created_at": "2025-12-26T22:10:01.434287",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 27
  },
  {
    "text": "Notwithstanding the foregoing, and by virtue of clause III Passengers and their Documentation - numeral 3, it shall be the responsibility of the Passengers to be informed, obtain and comply with the specific requirements imposed by the health authorities of each place of origin, stopover and destination, having to submit the documentation and/or undergo the examinations or procedures they require. The Carrier shall have no liability whatsoever for delays and/or denials of boarding or entry into a country suffered by the Passenger associated with or derived from the Passenger's",
    "chunk_id": "condiciones-generales_p27_c3",
    "content_hash": "2543c6ba8a6b6cad399802c1418cb20ed70b52ac84c1080bfb3ac598b8454b2c",
    "chunk_index": 3,
    "token_count": 104,
    "char_count": 583,
    "word_count": 89,
    "sentence_count": 2,
    "position_in_doc_percent": 55.73,
    "created_at": "2025-12-26T22:10:01.434658",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 27
  },
  {
    "text": "28\nfailure to comply with the obligations required by the health authorities of each place of origin, stopover or flight destination.",
    "chunk_id": "condiciones-generales_p28_c0",
    "content_hash": "d8a869543eac5223c24cd68983f13c20f6a206b93ab7adeb10173543226105d2",
    "chunk_index": 0,
    "token_count": 25,
    "char_count": 133,
    "word_count": 21,
    "sentence_count": 1,
    "position_in_doc_percent": 56.49,
    "created_at": "2025-12-26T22:10:01.434810",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 28
  },
  {
    "text": "29\nSPECIFIC REGULATIONS OF JETSMART AIRLINES Fare details At JetSMART Airlines there is a single fare that applies to all flights: the SMART fare which includes Fare Hand bag Carry-on bag Checked baggage Seat Selection Changes Refunds\nSMART Included baggage Additional Cost Additional Cost\nRandom assignment at no additional cost Seat selection at an additional cost\nName, flight, date and route changes allowed at an additional cost\nNo refunds or reimbursement of tickets or optional services are allowed. Refunds of boarding fees only The luggage included consists of one (1) handbag with maximum dimensions of 45cm x 35cm x 25cm (including wheels, pockets and handles) and a maximum weight of 10kg. It can be any item that can be carried on board under the front seat (with the exception of Passengers seated in an emergency exit or in the front row, in which case, it must be stored in the upper luggage rack). In addition to your handbag, you can bring a coat, a small pocket umbrella (must not have a sharp point), a small camera or a reading item (books, magazines, tablet) at no extra cost.",
    "chunk_id": "condiciones-generales_p29_c0",
    "content_hash": "94e994dff34dc568e4580cd92fd98943223daefc67bc91590d3243284644e16a",
    "chunk_index": 0,
    "token_count": 237,
    "char_count": 1098,
    "word_count": 187,
    "sentence_count": 4,
    "position_in_doc_percent": 57.25,
    "created_at": "2025-12-26T22:10:01.436211",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 29
  },
  {
    "text": "It is also recommended to carry any item of value and (or) fragile items within the handbag under the custody and supervision of the Passenger as JetSMART Airlines (the Carrier) will not be responsible for the loss or damage of such belongings, except in those cases and in accordance with the limits established in law or International Conventions that may apply. Baggage that does not comply with what is permitted will be sent by the Carrier to the aircraft hold as checked baggage, in which case the Passenger must pay for excess baggage, optional baggage service, or charge for oversized baggage as appropriate. Each leg/route of the Ticket is independent and does not require to be used in the order issued. Each Ticket is valid until the date and time of travel. The company can deny the transport in any of the legs, if the contracted fare has not been paid (in whole or in part), the Ticket has been obtained in violation of the law and/or the Passenger does not have the necessary documentation and/or requirements to travel.",
    "chunk_id": "condiciones-generales_p29_c1",
    "content_hash": "73f564e132c060f76d5ce4bd9ae0da824f14a679e125abf65555efaa2f3b12d1",
    "chunk_index": 1,
    "token_count": 203,
    "char_count": 1035,
    "word_count": 179,
    "sentence_count": 5,
    "position_in_doc_percent": 58.02,
    "created_at": "2025-12-26T22:10:01.436534",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 29
  },
  {
    "text": "30\nGroup bookings A group booking shall be understood as a reservation of tickets for 10 or more Passengers. Group bookings must be done through the \"Group Bookings\" section at www.jetsmart.com For group reservation requests, the number of Passengers must be indicated, and the list with the names of each Passenger will remain blank until the names are entered directly by the client at jetsmart.com through the \"Manage your trip\" section. Names must be entered no later than 72 hours prior to the flight for the check-in process and may be changed free of charge up to 24 hours prior to the flight. Thereafter, the change of name of any of the Passengers shall be governed by the general rule applicable to the SMART fare, and the customer shall pay the cost of the change service at the applicable rate on the date of request and in accordance with the conditions in force at that time. There will be no right to refund or price decrease in case one or more names of the Passengers of the reservation have not been informed within the deadline. The registration of the list and individualization of the Passengers benefiting from Group Booking Tickets shall be the exclusive responsibility of the person who made the reservation, and the check-in and boarding of such Passengers shall not be allowed unless the respective list has been communicated in writing to the Carrier at least 24 hours prior to the date of the flight.",
    "chunk_id": "condiciones-generales_p30_c0",
    "content_hash": "ae931affaea36d887df88ab84257ad96090a7f1239ec135a668a246fed729b2f",
    "chunk_index": 0,
    "token_count": 284,
    "char_count": 1428,
    "word_count": 247,
    "sentence_count": 6,
    "position_in_doc_percent": 58.78,
    "created_at": "2025-12-26T22:10:01.438422",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 30
  },
  {
    "text": "The group booking may be paid in full at the time of booking (\"Group Booking with Full Payment\") or you may choose the option of booking with partial payment (\"Group Booking with Partial Payment\"). The Group Reservation with Partial Payment option will only be granted to those quotations made 60 days or more prior to the flight date of the first leg of the reservation. Once a Group Reservation with Partial Payment has been made, the client will have 48 hours to pay an amount equivalent to 10% of the total value of the reservation. Only after such payment is made will the reservation be deemed to have been made and will remain in effect until 30 days prior to the date of the flight, within which time the customer must have confirmed the reservation by completing the payment of the reservation, i.e. paying the remaining balance of the reservation cost (including the costs of any applicable taxes, charges or aeronautical fees). If on the 30th day before the date and time of the flight (720 hours before the flight) the client has not confirmed their Group Reservation with Partial Payment by completing the payment in the terms indicated, the reservation will be automatically cancelled in full, and the client will not be entitled to a refund or reimbursement of the partial payment made. In this case, the total amount paid at the time of making the Group Reservation with Partial Payment will be retained for the benefit of JetSMART, as a compensation.",
    "chunk_id": "condiciones-generales_p30_c1",
    "content_hash": "e0e3a2798bf6679be559a5b867aa4c0ca60172cd6a9a318d2c49407e08f08210",
    "chunk_index": 1,
    "token_count": 285,
    "char_count": 1467,
    "word_count": 253,
    "sentence_count": 6,
    "position_in_doc_percent": 59.54,
    "created_at": "2025-12-26T22:10:01.438940",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 30
  },
  {
    "text": "Group reservations, regardless of the method of payment, are non-refundable and cannot be withdrawn or cancelled free of charge, except in the cases of withdrawal expressly provided for in the applicable law. Consequently, both in the case of Group Reservations with Full Payment and in the case of Group Reservations with Partial Payment, the non-use of the reserved tickets, or the client's request for refund or cancellation of the reservation will not entitle the client to a refund or",
    "chunk_id": "condiciones-generales_p30_c2",
    "content_hash": "fa1357a0e3c52e4d24806b2cb6510eb795ce81c54d25baa4a003a33a2a898e9e",
    "chunk_index": 2,
    "token_count": 94,
    "char_count": 489,
    "word_count": 79,
    "sentence_count": 2,
    "position_in_doc_percent": 60.31,
    "created_at": "2025-12-26T22:10:01.439110",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 30
  },
  {
    "text": "31\nreimbursement of the amounts paid to JetSMART, which will be retained for the benefit of JetSMART, as compensation, unless the conditions for the application of a right of withdrawal in accordance with applicable law are met. Notwithstanding the foregoing, the amount corresponding to taxes, charges or aeronautical rights paid by the client, in the case of Group Reservations with Total Payment, are exempted, in accordance with the law, which will be reimbursed through www.jetsmart.com or in the manner provided for in the applicable law. It is expressly stated on the record that in case of non-use or request for refund or cancellation of the Group Reservation with Partial Payment, the total amount paid at the time of making the Group Reservation with Partial Payment will be retained for the benefit of JetSMART, as a compensation. No part of the partial payment made by the customer in this type of reservation will be assigned to the payment of taxes, charges or aeronautical rights. For group bookings, air tickets will only be issued once full payment has been made, including the corresponding taxes, charges or aeronautical rights, in accordance with the terms and deadlines indicated in these Conditions. Changes to group reservations shall be governed by the provisions of the following paragraph, allowing changes of date, flight and route, subject to the payment, for all Passengers, of the total amount of the corresponding fine plus the difference in fares, if applicable.",
    "chunk_id": "condiciones-generales_p31_c0",
    "content_hash": "7d7a94f3a220ed29fe8e446396dbed8431c4117d9da7d7d78f67b6670eca242e",
    "chunk_index": 0,
    "token_count": 290,
    "char_count": 1495,
    "word_count": 240,
    "sentence_count": 6,
    "position_in_doc_percent": 61.07,
    "created_at": "2025-12-26T22:10:01.440957",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 31
  },
  {
    "text": "Changes All fares allow changes of date, flight, route and name, subject to payment of fines and/or fare difference as appropriate. The changes are per Passenger and per leg and can be made up to one hour before the flight departure time through the Contact Center. Changes at the airport will not be allowed, nor will changes after the flight. - For changes to the date, flight or route, a fine of $15,000 CLP must be paid for flights within Chilean territory, AR $899 for flights within Argentine territory and $24 USD for international flights, and up to $65USD for flights from and to Colombia, all of which are per Passenger for each leg plus the difference in fare, if applicable. - For changes to the name on the Ticket, except in cases of assignment expressly permitted in accordance with applicable law, a fine of $40,000 CLP must be paid for flights within Chilean territory, AR $2.899 for flights within Argentine territory and $65 USD for international flights, or flights from and to Colombia, all of which are per Passenger for each leg. Once the trip has begun, the name of the Ticket cannot be changed for any of the legs contained in the itinerary. In the case of reservations that include round trip flights, the request for a change of name must necessarily be made on both flights (legs), and the same person must be designated as the beneficiary of both tickets.",
    "chunk_id": "condiciones-generales_p31_c1",
    "content_hash": "de4f0eaa3c3bfe9a24b9905cd0005e895a81a253f50538639f41ac1554a1c4e1",
    "chunk_index": 1,
    "token_count": 288,
    "char_count": 1383,
    "word_count": 243,
    "sentence_count": 5,
    "position_in_doc_percent": 61.83,
    "created_at": "2025-12-26T22:10:01.441455",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 31
  },
  {
    "text": "Notwithstanding the foregoing paragraph, changes of name relating to Air Tickets issued from a group reservation (understood as a reservation of tickets for 10 or more Passengers), will not be",
    "chunk_id": "condiciones-generales_p31_c2",
    "content_hash": "87869c09c5961a101e11ee4adb99d242c539b69a23e87b63ebf4370eec975518",
    "chunk_index": 2,
    "token_count": 37,
    "char_count": 192,
    "word_count": 30,
    "sentence_count": 1,
    "position_in_doc_percent": 62.6,
    "created_at": "2025-12-26T22:10:01.441542",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 31
  },
  {
    "text": "32\nsubject to the fine indicated above, provided that the request for change of name is communicated to the Carrier at least 24 hours prior to the date of the flight, in the terms indicated under the aforementioned heading (Group Reservations). If the change is for a lower value service, the difference may be used to pay the fine or additional optional services. All optional services are kept for the new flight. If the Carrier is unable to confirm an optional service, it can be changed for the most similar option. If there is a balance in favor due to differences in the value of optional services, or if it cannot be confirmed in any category, this balance may be used as credit for the ticket change fine, without exceeding the value of the fine. Any excess balance will be in favor of JetSMART Airlines, not admitting any refund or use. Refunds Tickets and optional services are not refundable, except for those case of withdrawal expressly provided by the applicable law. In case of not taking the flight due to causes attributable to the Passenger, they can only request the refund of all boarding fees and taxes in accordance with the law, which will be refunded through the Carrier’s website or in the way stipulated in the applicable law. - For flights to or from Brazil, there is a fare that offers the possibility of reimbursement, this ticket can be purchased exclusively through the Call Center service.",
    "chunk_id": "condiciones-generales_p32_c0",
    "content_hash": "158bd4e32fc3006b9486eb2556b0d995ef3937fde24ab8bd8ca5000c597f5a63",
    "chunk_index": 0,
    "token_count": 278,
    "char_count": 1421,
    "word_count": 247,
    "sentence_count": 8,
    "position_in_doc_percent": 63.36,
    "created_at": "2025-12-26T22:10:01.443216",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 32
  },
  {
    "text": "Check-in and showing up at the airport Check-in can be made from 72 hours and up to 40 minutes before the flight departure time through the following website: www.JetSMART.com at no additional cost. You can also check in at the airport, at the JetSMART Airlines counter, upon payment of the service. Passengers flying to domestic destinations, in any of the applicable jurisdictions, must be present at the airport 120 minutes before the departure time of the flight. Check in and (or) delivery of checked baggage at the counter may take place up to 50 minutes prior to flight departure. Passengers flying to domestic destinations must be present at the airport 120 minutes before the departure time of the flight. Check in and (or) delivery of checked baggage at the counter may take place up to 70 minutes prior to flight departure. The boarding pass can be obtained free of charge at the following website: www.JetSMART.com at any time after checking in online and must be presented at the boarding gate in digital or printed format. If the Passenger wants to get their boarding pass at the airport counter, they will have to pay for this service. The cost of printing the boarding pass will be informed during the selection and contracting process, specifying the price and conditions during the purchase process. More information on the values of the service can be found at https://jetsmart.com/cl/es/opcionales/home",
    "chunk_id": "condiciones-generales_p32_c1",
    "content_hash": "4c485506dfd277a45d7bf77332ea59ca26042ae6fe2d8f4959a26e38d7dac26e",
    "chunk_index": 1,
    "token_count": 284,
    "char_count": 1422,
    "word_count": 234,
    "sentence_count": 10,
    "position_in_doc_percent": 64.12,
    "created_at": "2025-12-26T22:10:01.443710",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 32
  },
  {
    "text": "33\nPassengers who bought optional services after printing their boarding pass must print it or download it again to validate the new purchase and present it at the boarding gate. This because the vouchers of the purchased optional services will be printed on the boarding pass. Boarding gates will close 20 minutes before the departure of both domestic and international flights. It is exclusive responsibility of the Passenger to find out, obtain and comply with the travel requirements imposed by any authority and must inquire about the documents needed for their flight. Payment methods - For payments in Chile, the system accepts national and international credit and debit cards as means of payment. The use, payment terms, and other conditions applicable to credit cards are the sole responsibility of their issuer. The purchase of Tickets with a credit card is subject to the approval of the issuer of your card and the validations that may be appropriate for security reasons, without which you may not finalize your purchase and confirm or keep your reservation, in which case it will be rejected or canceled. For payments made at the airport, cash payments are accepted. - For payments in Uruguay, the system accepts national and international credit and debit cards as methods of payment. The use, payment terms, and other conditions applicable to credit cards are the sole responsibility of their issuer.",
    "chunk_id": "condiciones-generales_p33_c0",
    "content_hash": "6ee9fa73e617bb4f93002058bc4e52ea739595cc20b21a5aca97dbfc39cb59b9",
    "chunk_index": 0,
    "token_count": 254,
    "char_count": 1417,
    "word_count": 230,
    "sentence_count": 9,
    "position_in_doc_percent": 64.89,
    "created_at": "2025-12-26T22:10:01.445363",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 33
  },
  {
    "text": "The use, payment terms, and other conditions applicable to credit cards are the sole responsibility of their issuer. The purchase of Tickets with a credit card is subject to the approval of the issuer of your card and the validations that may be appropriate for security reasons, without which you may not finalize your purchase and confirm or keep your reservation, in which case it will be rejected or canceled. For payments made at the airport, only credit or debit card payments will be accepted. - For payments in Peru, credit cards will be accepted as payment methods. The use, payment terms, and other conditions applicable to credit cards are the sole responsibility of their issuer. The purchase of Tickets with a credit card is subject to the approval of the issuer of your card and the validations that may be appropriate for security reasons, without which you may not finalize your purchase and confirm or keep your reservation, in which case it will be rejected or canceled. For payments made at the airport, cash payments are accepted. - For payments in Argentina, debit and credit cards will be accepted as payment methods. The use, payment terms, and other conditions applicable to credit cards are the sole responsibility of their issuer. The purchase of Tickets with a credit card is subject to the approval of the issuer of your card and the validations that may be appropriate for security reasons, without which you may not finalize your purchase and confirm or keep your reservation, in which case it will be rejected or canceled.",
    "chunk_id": "condiciones-generales_p33_c1",
    "content_hash": "e63429faf67368fddd1696ed11e180ae67af80e2bc2ae1ad69e18c0ced161672",
    "chunk_index": 1,
    "token_count": 289,
    "char_count": 1553,
    "word_count": 263,
    "sentence_count": 8,
    "position_in_doc_percent": 65.65,
    "created_at": "2025-12-26T22:10:01.445839",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 33
  },
  {
    "text": "For payments made at the airport, cash payments are accepted. - For payments made from Brazil, JetSMART Airlines reserves the right to prohibit third party credit card purchases, or even request the card or the express authorization of the card owner before payment can be made.",
    "chunk_id": "condiciones-generales_p33_c2",
    "content_hash": "8a367f27bba4c0fb9a080f2ed35fca51ef24f7026f4146ea6379e0b6cdc43fe6",
    "chunk_index": 2,
    "token_count": 52,
    "char_count": 278,
    "word_count": 46,
    "sentence_count": 1,
    "position_in_doc_percent": 66.41,
    "created_at": "2025-12-26T22:10:01.445941",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 33
  },
  {
    "text": "34\n- For payments in Colombia, the system accepts national and international credit and debit cards as methods of payment. The use, payment terms, and other conditions applicable to credit cards are the sole responsibility of their issuer. The purchase of Tickets with a credit card is subject to the approval of the issuer of your card and the validations that may be appropriate for security reasons, without which you may not finalize your purchase and confirm or keep your reservation, in which case it will be rejected or canceled. For payments made at the airport, cash payments are accepted. In markets where JetSMART tickets are available for payment in cash at the offices of third party service payment box providers (offline payment) (\"Third Party Payment Centers\"), payment must be done by filling out and signing the form provided for such purpose in accordance with the instructions and terms established in the purchase process at www.jetsmart.com and those established by the provider of the respective Third Party Payment Center, being the sole responsibility of the person making the reservation and signing the corresponding form, to provide accurate and true personal and banking information included in such form.",
    "chunk_id": "condiciones-generales_p34_c0",
    "content_hash": "148eb015a43bcac597f343849e3f5cd54bea4d9fa7152ae170d69f8081162079",
    "chunk_index": 0,
    "token_count": 220,
    "char_count": 1234,
    "word_count": 197,
    "sentence_count": 5,
    "position_in_doc_percent": 67.18,
    "created_at": "2025-12-26T22:10:01.447679",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 34
  },
  {
    "text": "The refund of any monetary amount that may correspond in accordance with these Particular Regulations, for payments through Third Party Payment Centers, once the refund request entered at www.jetsmart.com has been accepted, JetSMART will make a bank transfer to the account indicated by the subscriber in the aforementioned form, which is expressly known and accepted by the subscriber, releasing JetSMART from any liability for any inconvenience that may arise as a result of the inaccuracy and/or lack of veracity of the information provided. Any reservation generated for payment at a Third Party Payment Center which is not paid in cash in the form and time established in the terms informed to the client in the purchase process, will be cancelled and rendered null and void. The reservation will only be confirmed once JetSMART receives and confirms the effective payment of the total amount of the reservation. Once the reservation is confirmed, JetSMART will issue and send by e-mail the corresponding ticket and proof of purchase to the customer, to the e-mail address provided by the customer in the form for payment at the Third Party Cashier's Office. Gift Card If the customer has received one of our Gift Cards, it can be exchanged at www.jetsmart.com, for one or more airline tickets and optional services, according to availability, at the prices published at www.jetsmart.com. Each Gift Card is a single coupon with a serial number that represents the fixed nominal value indicated on the Gift Card.",
    "chunk_id": "condiciones-generales_p34_c1",
    "content_hash": "db9338caf108e283709df8381bfcea1d882378241c7d576b2181e4cbb7f544e5",
    "chunk_index": 1,
    "token_count": 287,
    "char_count": 1516,
    "word_count": 245,
    "sentence_count": 6,
    "position_in_doc_percent": 67.94,
    "created_at": "2025-12-26T22:10:01.448157",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 34
  },
  {
    "text": "Each Gift Card is a single coupon with a serial number that represents the fixed nominal value indicated on the Gift Card. Only one (1) Gift Card can be used for each reservation, and if it is not used in full, the balance will not be refunded and will remain for the benefit of JetSMART Airlines. On the other hand, if the amount to be paid is higher than the amount of the Gift Card, the difference can be paid with any of the payment methods available at www.jetsmart.com. The Gift Card is not redeemable in cash, and cannot be used for payment of boarding fees; for this purpose, use any of the payment methods available at www.jetsmart.com Each Gift Card has a maximum expiration date indicated on it, upon expiration of which the Gift Card will have no effect or value, and the amount of the Gift Card will be automatically expired.",
    "chunk_id": "condiciones-generales_p34_c2",
    "content_hash": "70f613cd2f73d9d116aa8bf92b58d4b2401f8190668d1fb88f5bbcb4fad016d4",
    "chunk_index": 2,
    "token_count": 178,
    "char_count": 838,
    "word_count": 153,
    "sentence_count": 4,
    "position_in_doc_percent": 68.7,
    "created_at": "2025-12-26T22:10:01.448444",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 34
  },
  {
    "text": "35\nThe use of the Gift Card for commercial purposes, or the sale or transfer of the Gift Card, is expressly prohibited. Paid Gift Card In case a client has purchased or received a Paid Gift Card as a gift, its validation and use will be governed in accordance with the Terms and Conditions of Acquisition and Use of Paid Gift Cards accepted at the time of purchase of the respective Paid Gift Card. The text of the current Terms and Conditions for the Acquisition and Use of Gift Card Payment is available at http://www.jetsmart.com/cl/es/tyc/giftcard Boarding Fees and Taxes The applicable airport taxes and charges are additional to the fares and services published by the Carrier and are included in the final value published during the purchase process. Prior to the charge, the system will show the value of the fares per person, airport taxes, taxes and the total value that will be charged separately. Airport governments and/or local authorities may impose and collect additional fees or taxes at the airport. Fees for service in the purchase of tickets Purchases of air tickets done through the contact center and/or at the airport will have an additional fee properly informed in the corresponding sales channel. Travel Agency Fees Purchases of airline tickets through third party intermediaries, such as travel agencies, may include additional charges for the service they provide, which will be calculated and informed to the customer by the corresponding intermediary.",
    "chunk_id": "condiciones-generales_p35_c0",
    "content_hash": "03341dde9b660c1b4cd95040aa87d5f4064c39326c3deec9da39763026587c3b",
    "chunk_index": 0,
    "token_count": 278,
    "char_count": 1481,
    "word_count": 241,
    "sentence_count": 7,
    "position_in_doc_percent": 69.47,
    "created_at": "2025-12-26T22:10:01.449831",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 35
  },
  {
    "text": "Travel agencies may incorporate the respective agency fee under the denomination \"Cargo A.\", at the time of purchase of airline tickets in the portal for companies/travel agencies at www.jetsmart.com, with the informed consent, and the due power of representation of their client. The agency fee, if any, will be indicated in the corresponding purchase and reservation voucher, being the respective agency the responsible for such fee. Administration Fees/Administration Rate It is the fee for website management services and payment methods. This fee is already included in the SMART fare. Articles of high commercial value It is recommended to carry any item of value and (or) fragile items within the handbag under the custody and supervision of the Passenger as the Carrier will not be responsible for the loss or damage of such belongings.",
    "chunk_id": "condiciones-generales_p35_c1",
    "content_hash": "66ca85543edb56f5c5eadae2a6a1e9781427e4df2119b0d2c3f6e5fa2e5d1f3f",
    "chunk_index": 1,
    "token_count": 156,
    "char_count": 844,
    "word_count": 133,
    "sentence_count": 5,
    "position_in_doc_percent": 70.23,
    "created_at": "2025-12-26T22:10:01.450094",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 35
  },
  {
    "text": "36\nSpecial Needs Passengers with special needs who require special assistance are not required to provide prior notification of their condition, but are advised to do so at the time of purchasing the Ticket or by calling the contact center so that the Carrier can better assist them. The Carrier may require some information, medical certificate, special procedures, and/or companion for assistance, for the boarding of Passengers with special needs, illness or disability, in the cases and conditions provided by law. Passengers will be informed of this in a timely manner and this information is additionally available in the \"Frequently Asked Questions\" section at https://jetsmart.com/cl/es/PreguntasFrecuentes/ In no case will be understood that the Carrier verifies or issues any diagnosis regarding the Passenger's health or physical condition, the latter being solely responsible for verifying their health status by a competent doctor or professional, and whether they are fit to make the trip safely. Accordingly, the Carrier shall not be liable for any deterioration, event, or health condition suffered by the Passenger, including death during air transport, arising out of the Passenger's failure to seek medical advice or examination or failure to comply with a medical opinion.",
    "chunk_id": "condiciones-generales_p36_c0",
    "content_hash": "27b0d8db3034112422e3a251b80c29fc0d2c7f364c387ad169f32a5748b34cb1",
    "chunk_index": 0,
    "token_count": 236,
    "char_count": 1292,
    "word_count": 195,
    "sentence_count": 4,
    "position_in_doc_percent": 70.99,
    "created_at": "2025-12-26T22:10:01.451879",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 36
  },
  {
    "text": "The Carrier does not offer on their aircraft: (i) medical oxygen certified for use in aviation, to be used in the Passenger cabin of the aircraft; nor (ii) accommodation for a Passenger who needs to travel on a stretcher for resting reasons, problems to stand or simple loss of autonomy. Therefore, these services are not available. Passengers with disabilities or special needs and their companions boarding in Peru will have preferential and/or boarding privileges in accordance with Andean Community legislation. Wheelchairs, crutches, canes and prostheses may be transported at no additional cost, according to the procedures and conditions established in the applicable regulation It will be the sole responsibility of the Passenger to disassemble and assemble their wheelchair (whether mechanical or electric), as well as remove their battery, so that it is in a condition suitable for adequate transport by the company. A Passenger who, for medical indication, requires to carry a portable oxygen concentrator (POC) or medical oxygen certified for use in aviation, may do so at no additional cost, but must comply with the following conditions: 1. The make and model of the POC or medical oxygen must be one of those approved by the U.S. Federal Aviation Administration (FAA) or have a certificate or label indicating that the equipment is approved for aviation use.",
    "chunk_id": "condiciones-generales_p36_c1",
    "content_hash": "ff2abb15288965eb9a5886e8a6ad388e0972fc2b797ac8c8118b68806ccea152",
    "chunk_index": 1,
    "token_count": 266,
    "char_count": 1373,
    "word_count": 217,
    "sentence_count": 7,
    "position_in_doc_percent": 71.76,
    "created_at": "2025-12-26T22:10:01.452363",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 36
  },
  {
    "text": "Federal Aviation Administration (FAA) or have a certificate or label indicating that the equipment is approved for aviation use. A detailed list of FAA-approved POC equipment can be found at https://assets-us-01.kc-usercontent.com/b2956330-c34f-0064-2c6f-27bd5c0147fc/13188d5b-c603-4e8b-a77d-b9149d07eb5e/concentrador-oxigeno.pdf 2. In view of the need to verify that the Passenger can guarantee their own safety, the Carrier reserves the right to legally require, the presentation of a valid medical certificate stating that the Passenger is in a state of health that allows them to safely travel by air, using the POC or medical oxygen, as appropriate, including the origin-destination of the flight and the dates of departure and return.",
    "chunk_id": "condiciones-generales_p36_c2",
    "content_hash": "87fc1a2ce587847f842e090e9f031593fdb98b1c261780214e5f88ee18de0897",
    "chunk_index": 2,
    "token_count": 183,
    "char_count": 740,
    "word_count": 101,
    "sentence_count": 3,
    "position_in_doc_percent": 72.52,
    "created_at": "2025-12-26T22:10:01.452613",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 36
  },
  {
    "text": "37\n3. It is recommended that the Passenger inform through the Contact Center that they will be traveling with a POC or medical oxygen in the cabin at least 24 hours prior to flight departure. Such prior notice shall be a necessary condition in the event that the Passenger requires any accommodation from the Carrier regarding the use of certified medical oxygen in the cabin. 4. The Passenger must be able to understand and respond in a timely manner to the alarms and indicators that may be transmitted by the POC, otherwise they must be travel accompanied by someone who can do it for them. 5. The POC batteries must be in good condition and have an autonomy equivalent to 150% of the flight time, including stopovers and connections. Additional batteries should be individually packaged to avoid contact between them. 6. The Passenger may not be seated in a front row seat or emergency exit. If necessary, the POC can remain connected during the trip as long as it is placed under the front seat. The transportation of POC or medical oxygen or devices containing it that do not comply with the above requirements will not be allowed. Boarding of Passengers may be denied when, due to their state of health, it is evident that such person cannot guarantee their safety or well-being or that of the other Passengers, and there is no evidence to the contrary in a valid medical certificate.",
    "chunk_id": "condiciones-generales_p37_c0",
    "content_hash": "834754d8586b03eded51abb76d3b8eee5d6f7a576af28aeec6988247cc59ac75",
    "chunk_index": 0,
    "token_count": 278,
    "char_count": 1391,
    "word_count": 242,
    "sentence_count": 10,
    "position_in_doc_percent": 73.28,
    "created_at": "2025-12-26T22:10:01.454465",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 37
  },
  {
    "text": "The Carrier may require an accompanying Passenger when it is evident that the Passenger is not autonomous. - Applicable in the Republic of Chile: Air transportation of Passengers with special needs shall be carried out in accordance with the provisions of Decree 369, issued by the Undersecretary for the Armed Forces on July 26, 2017, as well as other applicable regulations. - Applicable in the Argentine Republic: In accordance with Article 8 - Annex I of MEOySP 1532/1998 Resolution the Carrier has the right to refuse transport if the behavior, age or mental or physical state of the Passenger is such that it requires special assistance from the Carrier. - Applicable in Brazil: Air transport of Passengers with special needs will be carried out in accordance with Resolution No. 280 of the National Civil Aviation Agency, as well as in the other applicable regulations. - Applicable in Peru: The air transportation of disabled persons, pregnant women and senior citizens shall be carried out in accordance with the provisions of Law No. 28735, as well as other applicable regulations. For domestic flights in Peru, Passengers with disabilities, pregnant women and senior citizens are obliged to inform the Carrier of the special attention they require according to their condition, when purchasing the ticket or booking the flight and at least twenty-four (24) hours prior to the departure time of the flight, except in emergency cases.",
    "chunk_id": "condiciones-generales_p37_c1",
    "content_hash": "ca6adec87bce029f3504f119a3b7c8243c5a3d99c9856afdc33bb568c5d68de8",
    "chunk_index": 1,
    "token_count": 285,
    "char_count": 1443,
    "word_count": 233,
    "sentence_count": 2,
    "position_in_doc_percent": 74.05,
    "created_at": "2025-12-26T22:10:01.454814",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 37
  },
  {
    "text": "Infants and children Children under 2 years of age are considered infants and travel free of charge. Infants are not entitled to a seat and must travel in the arms of the adult accompanying them, so only one infant per adult is allowed.",
    "chunk_id": "condiciones-generales_p37_c2",
    "content_hash": "bb548d194e7ea57159fd4e135c862598bee16d3c5bcb02557681fe3063a8fb9b",
    "chunk_index": 2,
    "token_count": 49,
    "char_count": 236,
    "word_count": 43,
    "sentence_count": 2,
    "position_in_doc_percent": 74.81,
    "created_at": "2025-12-26T22:10:01.454942",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 37
  },
  {
    "text": "38\nInfants are allowed to travel with a handbag and a baby carriage. Both items at no additional cost. Age is applied on the end date of the trip, not on the date of purchase. If on the date of the flight the child does not meet the age allowed to be considered as an infant, you must pay a child ticket occupying a seat. JetSMART Airlines does not have an \"Unaccompanied Minor\" service; therefore, Passengers between 0 and 14 years old minus one day may not travel alone, they must be accompanied by an adult, over 18 years old, who is responsible for their care during the flight. Pregnant Women If you are less than 28 weeks pregnant, have no complications and are in good health, you can travel without a medical certificate. However, if you have pregnancy complications, are at high risk, or have health problems, you must present a medical certificate in the terms indicated in the following paragraph. If you are 29 weeks or more pregnant, in order to be allowed to board, you must present to the company a medical certificate authorizing you to travel.",
    "chunk_id": "condiciones-generales_p38_c0",
    "content_hash": "9fd6695a7a5a3a643b4ffa1791cd214b839630b719be295fb0779151caa8c957",
    "chunk_index": 0,
    "token_count": 229,
    "char_count": 1060,
    "word_count": 190,
    "sentence_count": 8,
    "position_in_doc_percent": 75.57,
    "created_at": "2025-12-26T22:10:01.456504",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 38
  },
  {
    "text": "The certificate must contain the following minimum information: - Date of issue of the Medical Certificate (maximum 10 days prior to the start of the trip). - Passenger's information: Name and surname, as well as the passenger's Tax ID number. - Flight Itinerary (dates and route) - Weeks of gestation - Express declaration that the passenger is fit to travel by plane. - Physician's information (must be an obstetrician/gynecologist) (Rut or DNI, signature and stamp). You cannot board if you are within 7 days before or 7 days after the date of delivery. The above regulations apply to both single and multiple pregnancies. - For flights departing from Brazil, air transport of pregnant women will be carried out in accordance with Resolution No. 280 of the National Civil Aviation Agency, as well as in the other applicable regulations. - For flights departing from Uruguay, air transport of pregnant women will be carried out in accordance with Resolution No. 165/997 National Directorate of Civil Aviation and Aeronautical Infrastructure and applicable regulations. Baggage Hand bag Baggage included in the airfare that each Passenger may carry on board during the trip, will be under their own supervision Its maximum dimensions are 45cm x 35cm x 25cm (length, width, height) and a maximum weight of 10kg, including wheels, handles, pockets, etc...",
    "chunk_id": "condiciones-generales_p38_c1",
    "content_hash": "f00d558c01562619ecdf9e0ad08f3e89e7de5c0a2900c844d81fab0e210aea5a",
    "chunk_index": 1,
    "token_count": 282,
    "char_count": 1354,
    "word_count": 217,
    "sentence_count": 4,
    "position_in_doc_percent": 76.34,
    "created_at": "2025-12-26T22:10:01.456922",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 38
  },
  {
    "text": "Only one handbag per Passenger is allowed If the Passenger wants to carry a second handbag, this one must be carried and charged as carry-on luggage.",
    "chunk_id": "condiciones-generales_p38_c2",
    "content_hash": "0856c4504dfbdcbe1d0bf27d719b4e00e964111c1fb34fc5ee574a281b02dde7",
    "chunk_index": 2,
    "token_count": 31,
    "char_count": 149,
    "word_count": 26,
    "sentence_count": 1,
    "position_in_doc_percent": 77.1,
    "created_at": "2025-12-26T22:10:01.457017",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 38
  },
  {
    "text": "39\nPrices of Packs and Optional Services The value of any optional service depends on the time of purchase, its availability and the date and/or destination of the Passenger’s flight, as reported during the selection and booking process, detailing the final price and conditions thereof before making your purchase. Consequently, if the Passenger decides to postpone the purchase of Packs and/or optional services, or modify the date and/or route of their trip, the values of the services may vary, being those values published and in force at the time of purchase of the respective Packs and optional services applicable. If you decide to save by purchasing an optional pack available at www.jetsmart.com, please note that optional packs can only be purchased at the time of ticket purchase, and are subject to the same conditions of the optional packs described in these Special Regulations, so they cannot be returned or refunded, and the final price and conditions thereof will be informed to you before making your purchase. The purchase of a Pack of optional services applies to all the Passengers of the same reservation, and its value is per Passenger and per leg. For Packs that include seat selection, seat selection will be subject to availability at the time of purchase. After the purchase of any optional and/or optional pack, the Passenger will receive the corresponding voucher which includes the relevant information of your purchase and the other accepted conditions, which are part of the conditions of your ticket.",
    "chunk_id": "condiciones-generales_p39_c0",
    "content_hash": "ec3b43b35f1dc86a508fdb596ee019d3919a0203be867355d271fd3521edf608",
    "chunk_index": 0,
    "token_count": 280,
    "char_count": 1534,
    "word_count": 248,
    "sentence_count": 6,
    "position_in_doc_percent": 77.86,
    "created_at": "2025-12-26T22:10:01.458718",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 39
  },
  {
    "text": "The availability of optional items will be informed at the time of requesting their purchase, so if they are not available for purchase, the customer will be informed at the time of requesting them. Likewise, the availability of optional items at a given time does not guarantee that they will remain available for purchase in the future, nor in the same conditions or prices. Carry-on bag Baggage, at an additional cost, which can be taken in the cabin of the airplane, under the supervision of the Passenger. It can weigh up to 10kg and cannot exceed these dimensions: 55cm x 35cm x 25cm (length, width, height), including wheels, handles, pockets, etc. Only one large cabin baggage is allowed per Passenger. If the Passenger wants to carry a second carry-on bag, this one must be carried and charged as checked luggage. In the event that the hand luggage exceeds the dimensions or weight established, it may not be carried in the cabin of the aircraft and will be checked and sent to the hold of the aircraft. The Passenger must pay the corresponding difference in value. Properly packed guitars or basses may be considered large cabin baggage. Checked baggage Baggage, at an additional cost, transported in the hold of the airplane, under the supervision of the company.",
    "chunk_id": "condiciones-generales_p39_c1",
    "content_hash": "77d129bc15f3a4ec362ff81ba76039ecd2ee2fc3a33ecf1367682aa2ec002145",
    "chunk_index": 1,
    "token_count": 260,
    "char_count": 1274,
    "word_count": 216,
    "sentence_count": 10,
    "position_in_doc_percent": 78.63,
    "created_at": "2025-12-26T22:10:01.459167",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 39
  },
  {
    "text": "40\nIt can weigh up to 23kg and cannot exceed 158 linear cm. Each Passenger may carry a maximum of 5 checked baggage items. Checked baggage must be presented at the airport counter unless expressly communicated otherwise. Failure to comply with this condition may result in fines. Oversized equipment (sporting goods or musical instruments) Checked baggage, at an additional cost, with a maximum weight of 23Kg and dimensions larger than 158 linear cm and smaller than 230 linear cm with the exception of surfboards that can measure up to 300 linear cm. Each Passenger may carry a maximum of 3 oversized baggage items, subject to availability. Oversized baggage must be presented at the airport counter unless expressly communicated otherwise. Failure to comply with this condition may result in fines. Excess baggage Baggage exceeding 23 kg (up to 32 kg) and which will be allowed upon payment of the excess baggage fee. If a Passenger shows up for boarding with baggage exceeding what is permitted and has not paid the respective fee, the difference will be charged at the airport, subject to availability and according to the value of excess baggage in force at that time. If the Passenger does not pay, or oversized checked baggage is not available. the unpaid luggage will be denied check in. Luggage weighing more than 32 kg will not be accepted.",
    "chunk_id": "condiciones-generales_p40_c0",
    "content_hash": "be8f180c6afd2cc47680c56ef2fe21b545cfad85dcc645d9269e0676531c1fc0",
    "chunk_index": 0,
    "token_count": 271,
    "char_count": 1351,
    "word_count": 226,
    "sentence_count": 12,
    "position_in_doc_percent": 79.39,
    "created_at": "2025-12-26T22:10:01.460676",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 40
  },
  {
    "text": "Luggage weighing more than 32 kg will not be accepted. Contracting the checked baggage, oversized baggage and/or excess baggage options, regulated in the preceding paragraphs, shall be subject to their availability at the time of contracting them, taking into account the space and weight limitations of the aircraft hold. As a result, the sale of such optional items may not be available through any of the company's sales channels, including www.jetsmart.com,Contact Center and/or at the airport. Delay or lost baggage In case of missing and/or damaged luggage, the Passenger must file a claim immediately at the airport baggage drop-off area or up to a maximum of 7 days after the arrival of the flight. - However, for flights made within the national territory of the Republic of Argentina, in case of loss, destruction or delay, the Passenger’s claim must be made to the Carrier, at the baggage claim area, immediately or up to a maximum of 10 days following the date of arrival of the flight. In the event of a breakdown, the maximum period will be 3 days from the date of delivery of the luggage.",
    "chunk_id": "condiciones-generales_p40_c1",
    "content_hash": "32ade43b4c5d546fab0ac00dd9825a938aa8fca2a2759cb7f95d44510c81d28a",
    "chunk_index": 1,
    "token_count": 225,
    "char_count": 1103,
    "word_count": 187,
    "sentence_count": 5,
    "position_in_doc_percent": 80.15,
    "created_at": "2025-12-26T22:10:01.461023",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 40
  },
  {
    "text": "41\n- For flights to Brazil, the reception of checked baggage, without receiving the Passenger’s complaint, will constitute a presumption that it has been delivered in good condition. The carrier must return the lost luggage, to the place indicated by the Passenger, respecting the following deadlines: - in up to 7 (seven) days in the case of domestic flights; or II - in up to 21 (twenty-one) days, in the case of international flights. If the luggage is not found within the deadlines established in this paragraph, the carrier must compensate the Passenger within 7 (seven) days. In cases where the Passenger notices the violation of the contents of the luggage or damages in it, he must file a complaint to the carrier within seven (7) days of having received it. - In Uruguay, liability for baggage is governed by the applicable regulations. Acceptance of the baggage, without any complaint by the recipient, shall constitute a presumption that it was delivered in good condition and in accordance with the transport contract. In the event of damage, the Passenger must file a complaint for any damaged baggage to the Carrier within a period of three days from the reception date. In case of delay, the complaint must be filed within fourteen days at the latest from the date on which the baggage should have been delivered to the Passenger.",
    "chunk_id": "condiciones-generales_p41_c0",
    "content_hash": "8e5ba18d5674f961e1881a3226e9c0273c2faa479eed6f985e5ca877b46d6fd2",
    "chunk_index": 0,
    "token_count": 266,
    "char_count": 1346,
    "word_count": 228,
    "sentence_count": 7,
    "position_in_doc_percent": 80.92,
    "created_at": "2025-12-26T22:10:01.462764",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 41
  },
  {
    "text": "All complaints must be filed by means of a reservation recorded on the transport document or by means of a written notice issued within the time limit established for such complaint. In the absence of complaint, actions against the Carrier shall be inadmissible, except in the case of fraud committed by the Carrier. Seat Selection Seats may be selected by paying associated charges as informed during the selection and booking process. Passengers may travel in an emergency exit row seat provided they meet the following requirements: 1. They must be at least 15 years old 2. They must be able to read, understand and communicate in Spanish or English 3. Must not be traveling with someone else who requires their assistance or care. Example: minors under 15 years of age or people with an illness or special needs. 4. They must have sufficient mobility, strength, balance and ability to remove obstacles, manipulate emergency exits and exit quickly, helping other Passengers. 5. They must have the auditory and visual ability to understand instructions given by crew members, the must also be able to give verbal information to other Passengers, and operate the emergency exit. 6. They must not suffer from any condition that may be affected or aggravated by handling the emergency exit. 7. They have to be willing to assist other Passengers if necessary. 8. They must not be traveling with a pet in the cabin.",
    "chunk_id": "condiciones-generales_p41_c1",
    "content_hash": "99fd08bb1a29d88ad682434434cc3f0e4163c5f577b28c7eff9d5fda3b614ca1",
    "chunk_index": 1,
    "token_count": 281,
    "char_count": 1412,
    "word_count": 236,
    "sentence_count": 13,
    "position_in_doc_percent": 81.68,
    "created_at": "2025-12-26T22:10:01.463259",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 41
  },
  {
    "text": "They have to be willing to assist other Passengers if necessary. 8. They must not be traveling with a pet in the cabin. If the Passenger does not meet any of these requirements, the Carrier will assign the Passenger another seat for operational safety reasons and the value paid for such seat will not be refunded. Under current regulations, the Carrier is required not to assign a Passenger a seat next to an",
    "chunk_id": "condiciones-generales_p41_c2",
    "content_hash": "efb60d5ba2b2bba7ef90e74e49f937dc30e79796fcecb20d648131981fcc2105",
    "chunk_index": 2,
    "token_count": 81,
    "char_count": 409,
    "word_count": 73,
    "sentence_count": 4,
    "position_in_doc_percent": 82.44,
    "created_at": "2025-12-26T22:10:01.463404",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 41
  },
  {
    "text": "42\nemergency exit if the Carrier determines that the Passenger is unable to perform one or more of the functions required for that seat, or if the Passenger does not wish to perform those functions or may suffer physical harm as a result of performing those functions Passengers with special needs and pregnant women have the right to be changed to preferred seats upon request at the airport counter but such change is subject to availability. JetSMART Airlines is not responsible for children being assigned to separate seats from their parents if they have not previously purchased the seats. In the event of an emergency in which there is no crew member in each exit seat available to assist, a Passenger occupying an exit seat may be called upon to perform the following tasks. However, JetSMART Airlines is not obliged to respond or compensate - in cash or any other form - when a Passenger performs such task: 1. Locate the emergency exit. 2. Understand the emergency exit opening mechanism. 3. Understand instructions for operating emergency exits. 4. Operate the emergency exit. 5. Assess whether the hazards to which Passengers may be exposed will increase if the emergency exit is opened. 6. Follow spoken instructions and hand signals given by a crew member. 7. Keep or secure the emergency exit door so that it does not obstruct the use of the exit. 8.",
    "chunk_id": "condiciones-generales_p42_c0",
    "content_hash": "b2371cafaf6e71f635c0e5b842c4234cb5357c92e37e8c330075277d8dc9cb11",
    "chunk_index": 0,
    "token_count": 269,
    "char_count": 1365,
    "word_count": 233,
    "sentence_count": 11,
    "position_in_doc_percent": 83.21,
    "created_at": "2025-12-26T22:10:01.464965",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 42
  },
  {
    "text": "Keep or secure the emergency exit door so that it does not obstruct the use of the exit. 8. Evaluate the condition of the escape slide, activate the slide and stabilize it after deployment to assist others in using the slide device. 9. Effectively move through the emergency exit and 10. Evaluate, select, and follow a safe path from the emergency exit. Preferential boarding It is the right to board the plane before the rest of the Passengers who don’t enjoy such right. To ensure delivery of the service, the Passenger must be present at the boarding gate at least 30 minutes prior to departure of the flight. If the required advance notice is not met, the price of the service will not be refunded The cost of preferential boarding will be informed during the selection and contracting process, specifying the price and conditions before completing the purchase process. - For flights departing from Brazil, priority should be given to the elderly (people over 60), people with disabilities (Passengers with Special Needs), pregnant women and mothers or fathers with babies. Law no. 13466/2017 established that persons over 80 years of age have special priority and must be treated before other elderly people. - For flight departing from Uruguay, preferential boarding should be made available for children under 5 years of age, people with disabilities and the elderly, providing assistance and make seating more comfortable.",
    "chunk_id": "condiciones-generales_p42_c1",
    "content_hash": "1a80629538e53ab246b62774accb5a688ce4914da5176fb6ca8614dd007ed408",
    "chunk_index": 1,
    "token_count": 280,
    "char_count": 1431,
    "word_count": 234,
    "sentence_count": 8,
    "position_in_doc_percent": 83.97,
    "created_at": "2025-12-26T22:10:01.465462",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 42
  },
  {
    "text": "43\nPet in cabin At JetSMART Airlines we want your pet to be able to travel SMART. The transportation of your pet in the cabin is a service to which the conditions of baggage transportation will apply, for all legal purposes, a circumstance accepted by the passenger and by the person contracting the service, if different, and will be conditioned to the payment of the respective service according to the value informed during the contracting process, and to the fulfillment of the terms of service. To ensure the standard of care for our passengers and the care of your pet, the provision of this service is subject to the following terms and conditions: - The cabin pet service is only available on direct, non-connecting flights, and the reported value of the service is a per passenger, per leg value. - Only dogs and cats of docile behavior are allowed on board, without prejudice to the exclusions duly indicated in this document. The transportation of other pets is not allowed. - A passenger may only transport one (1) pet (dog or cat). - The maximum number of pets to be transported on each flight is four (4).",
    "chunk_id": "condiciones-generales_p43_c0",
    "content_hash": "8d04b264a096662537ba9a99dd274ab2d50933b5832806cbdcfd864e75f11835",
    "chunk_index": 0,
    "token_count": 224,
    "char_count": 1119,
    "word_count": 196,
    "sentence_count": 4,
    "position_in_doc_percent": 84.73,
    "created_at": "2025-12-26T22:10:01.466947",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 43
  },
  {
    "text": "In consideration of the above, the provision of the service will always be subject to availability, which must be consulted by the passenger through the Contact Center at least forty-eight (48) hours in advance, counted backwards from the departure of your flight; - The maximum allowed weight of the pet plus the container is ten (10) kilos, they must be at least three (3) months old, cannot be in a state of pregnancy, cannot be under the effect of tranquilizers and cannot have a bad odor or generate noises that disturb passengers and / or crew; - Passengers using this service must make sure that their pets are in appropriate health conditions for transportation under the highest safety standards, and agree to be responsible for their care, medication and attention during the entire trip, as well as for any contingencies that may arise from this. - Acceptance for animal transportation is subject to the condition that the passenger assumes full responsibility for the animal. JetSMART Airlines will not be liable for damages, losses, delays, illness or death of the animal in the event that it is denied entry or transit through any country, state or territory. - Passengers making use of this service are responsible for procuring, paying for and arranging for all valid health and vaccination certificates, entry permits, International Veterinary Certificates and all other documents and/or procedures required by the states of departure and entry.",
    "chunk_id": "condiciones-generales_p43_c1",
    "content_hash": "3fa70ec292e57c97f9be3daae32f7b6411d7ecd1826023f5b39ee09288274ab6",
    "chunk_index": 1,
    "token_count": 276,
    "char_count": 1462,
    "word_count": 237,
    "sentence_count": 2,
    "position_in_doc_percent": 85.5,
    "created_at": "2025-12-26T22:10:01.467275",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 43
  },
  {
    "text": "44\n- Pets must travel and remain during the entire course of the flight in a soft, personal and closed container in which they must enter standing up, and that positioned under the front seat has the following characteristics: 38 centimeters long; 35 centimeters wide; 22 centimeters high; It must have waterproof/absorbent floor; It must have adequate ventilation so that the pet can breathe without problems. - Passengers using this service may not travel in a front row seat or emergency exit row; - Since not all pets have the physiological conditions necessary to be transported safely by air, and notwithstanding the fact that it is the passenger's ultimate responsibility to ensure that his/her pet has the necessary physiological conditions.",
    "chunk_id": "condiciones-generales_p44_c0",
    "content_hash": "22f853f896c18263d70704e13a2201c993f4b9e6659f369ccd5cd041e44969f8",
    "chunk_index": 0,
    "token_count": 145,
    "char_count": 749,
    "word_count": 120,
    "sentence_count": 1,
    "position_in_doc_percent": 86.26,
    "created_at": "2025-12-26T22:10:01.469176",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 44
  },
  {
    "text": "Notwithstanding other documentation and procedures that may be required by JetSMART Airlines or by the competent authorities, the acceptance and transportation of the pet on domestic flights is subject to the presentation of the following documentation at the counter, at least two (2) hours prior to the flight departure: Certificate issued by a veterinarian (in the Republic of Argentina, according to the model provided by the Council or College of the Jurisdiction) with a validity of no more than 10 days counted backwards from the date of the flight, stating its age and breed, and certifying that its state of health is suitable for it to make the trip; Without prejudice to other documentation and procedures that may be required by JetSMART Airlines or by the competent authorities, the acceptance and transport of the pet on international flights is subject to the presentation of the following documentation (original and photocopies), at least three (3) hours before the flight departure date: Certificate issued by a veterinarian (For flights made from or to the Republic of Argentina, according to the model provided by the Council or College of the Jurisdiction) with a validity of no more than 10 days counted backwards from the date of the flight, that shows its age and breed, and that accredits that its state of health is apt for it to make the trip; Zoosanitary Export Certificate (CZE), issued by the Agriculture and Livestock Service (SAG), if applicable and/or International Veterinary Certificate (CVI) issued by the National Service of Health and Agri-Food Quality (SENASA) of Argentina, if applicable, which certifies that the pet meets the entry requirements of the country of destination.",
    "chunk_id": "condiciones-generales_p44_c1",
    "content_hash": "8d1ab78f3d878a0a5e2845add86aeee80defa53dae76589eb76619206cf9dcd6",
    "chunk_index": 1,
    "token_count": 333,
    "char_count": 1717,
    "word_count": 275,
    "sentence_count": 1,
    "position_in_doc_percent": 87.02,
    "created_at": "2025-12-26T22:10:01.469568",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 44
  },
  {
    "text": "Consult the requirements demanded by the country of destination at http://reqpecuaria.sag.gob.cl/ (see information below for Argentina). Notwithstanding the above, the transportation of the pet is subject to the health and documentation restrictions established by the health authority of each country, so it will be the passenger's responsibility to be informed of them and will be responsible for any cost derived from their compliance. - For the Republic of Argentina, both the entry and exit of pets (dogs and cats) in temporary character, as well as their internal transportation, is the sole responsibility of the passenger, who in addition to the presentation of the above-mentioned requirements, is obliged and responsible for knowing and complying with all the documentary requirements and procedures imposed by the competent health authorities. For further information, we urge you to contact: Documentation and Public Information Department of SENASA through any of these channels: E-mail: cdei@senasa.gob.ar. Telephones: (54-11) 4121- 5460/5461 - Toll free: 0800-999-2386. Office hours: Monday to Friday from 9:00 am to 5:00 pm. http://mascotas.senasa.gob.ar/index.php/consultar_requisitos http://mascotas.senasa.gob.ar/index.php/default/index.",
    "chunk_id": "condiciones-generales_p44_c2",
    "content_hash": "138c7a48875619240ce4877b44d459b6df9b46bdc988a00e8e633040f33f41fd",
    "chunk_index": 2,
    "token_count": 276,
    "char_count": 1256,
    "word_count": 169,
    "sentence_count": 5,
    "position_in_doc_percent": 87.79,
    "created_at": "2025-12-26T22:10:01.470175",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 44
  },
  {
    "text": "45\n- For flights originating from or to Brazil, an IVC (International Veterinary Certificate) or a passport is required for the transit of dogs and cats (for countries with which Brazil has an equivalence agreement), issued by GEOGLAM (Brazilian acronym VIGIAGRO), International Agriculture Monitoring Initiative). Resolution No. 280 of the National Civil Aviation Agency determines that guide dogs must be transported free of charge on the floor of the aircraft cabin, next to their owner and under his control, equipped with a harness and are exempt from wearing a muzzle. The guide dog must be accommodated so as not to obstruct the aircraft corridor and must carry certificates attesting to the fact that they are guide dogs. In addition, the requirements of the national health authorities and those of the country of destination must be complied with.",
    "chunk_id": "condiciones-generales_p45_c0",
    "content_hash": "0a50e4f14162c45e6dc693f17ae2d116f41e5ff513c5b86912ab418de6cc060e",
    "chunk_index": 0,
    "token_count": 164,
    "char_count": 857,
    "word_count": 137,
    "sentence_count": 4,
    "position_in_doc_percent": 88.55,
    "created_at": "2025-12-26T22:10:01.471811",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 45
  },
  {
    "text": "In addition, the requirements of the national health authorities and those of the country of destination must be complied with. With reference to the transport of guide dogs, for the Federative Republic of Brazil, the rules established in Resolution 280 of ANAC - National Civil Aviation Agency apply (For more information, consult: https://www.anac.gov.br/assuntos/legislacao/legislacao-1/resolucoes/resolucoes2013/resolucaono-280-de-11-07-2013/@@display-file/arquivo_norma/RA2013- 0280.pdf). - For the transport of pets to or from Paraguay, the requirements of the National Animal Health and Quality Service of Paraguay (SENACSA) must be observed, and Resolution MERCOSUR/GMCM/RES.",
    "chunk_id": "condiciones-generales_p45_c1",
    "content_hash": "e4eb6dd42abf8328ffddf66548a77fb70d558584d319b18e01d569fd9dfde2af",
    "chunk_index": 1,
    "token_count": 168,
    "char_count": 683,
    "word_count": 83,
    "sentence_count": 2,
    "position_in_doc_percent": 89.31,
    "created_at": "2025-12-26T22:10:01.472082",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 45
  },
  {
    "text": "No. 17/15, \"Zoosanitary Requirements of the States Parties for the Entry of Domestic Canines and Felines: http://documentos.senacsa.gov.py/share/s/uy3CHGS0RT63b7e7BO716g. - For the transport of pets (limited to dogs and cats) to or from Uruguay, the current requirements demanded by the Ministry of Livestock, Agriculture and Fisheries and/or any other competent authority must be observed: https://www.gub.uy/tramites/solicitud-ingreso-mascotas-uruguay and https://www.gub.uy/tramites/solicitud-egreso-mascotas-uruguay. FlexiSMART FlexiSMART is an optional feature offered at the time of ticket purchase at www.jetsmart.com, in the optional services section, and allows the customer to change their itinerary (change of date, time, and/or route, without paying the applicable change penalty or fine in accordance with the \"Changes\" section of these Particular Regulations, but paying the corresponding fare difference, if any. FlexiSMART is not limited to a single change, but allows multiple changes to be made to the same ticket, for one year from the date of the original flight. The FlexiSMART option applies to the entire reservation and to all Passengers under the same.",
    "chunk_id": "condiciones-generales_p45_c2",
    "content_hash": "72862457df92d1da02b158f5b61449524f0756bea23e50f7ce12ee02b6c80967",
    "chunk_index": 2,
    "token_count": 277,
    "char_count": 1177,
    "word_count": 159,
    "sentence_count": 4,
    "position_in_doc_percent": 90.08,
    "created_at": "2025-12-26T22:10:01.472513",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 45
  },
  {
    "text": "The FlexiSMART option applies to the entire reservation and to all Passengers under the same. The value of the FlexiSMART option will be informed during the purchase process, and the final price and conditions will be detailed before the purchase process is complete. The amount paid for the FlexiSMART option is non-refundable, except in cases where JetSMART is obliged to refund the ticket, in which case it will also reimburse the amount paid for the FlexiSMART option. Failure to use the right to change the itinerary provided by the FlexiSMART optional will not entitle the customer to any refund or reimbursement of the price paid for such optional service.",
    "chunk_id": "condiciones-generales_p45_c3",
    "content_hash": "764e8c17c96161c35acad29ab620b090a2c0b57d7f8d2a016cde7e7bcdb3cc39",
    "chunk_index": 3,
    "token_count": 132,
    "char_count": 663,
    "word_count": 109,
    "sentence_count": 4,
    "position_in_doc_percent": 90.84,
    "created_at": "2025-12-26T22:10:01.472729",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 45
  },
  {
    "text": "46\nThe FlexiSMART option does not allow changes other than those indicated above (change of date, time, and/or route. Any other changes shall be governed by the provisions under the heading \"Changes\" of these Special Regulations. The exercise of the right to making changes granted by the FlexiSMART option is subject to flight and seat availability on the new chosen itinerary. The changes are per Passenger and per leg and can be made up to one hour before the flight departure time through the Contact Center. Changes at the airport will not be allowed, nor will changes after the flight. The other conditions applicable to the changes are detailed under the heading \"Changes\" of these Special Regulations. Freeze your price \" Freeze your price\" is an option that JetSMART may offer the customer in the purchase process of their tickets at www.jetsmart.com after they have selected their flights and chosen the Pack of optional services, and that allows the customer to freeze the final price of their reservation and keep it available for a period of 24 hours or 48 hours, depending on the customer's choice, paying the value corresponding to the chosen option. Freeze your price therefore allows the customer to purchase a reservation within the selected freeze period while maintaining the final price and availability of the reservation, thus avoiding the risk of a price increase and ensuring availability on the selected flights within the freeze period.",
    "chunk_id": "condiciones-generales_p46_c0",
    "content_hash": "ff17a4bfa7c6c56cd2b0ecb74b6948b464c43be3ef339ec2a3fc091bd079f150",
    "chunk_index": 0,
    "token_count": 274,
    "char_count": 1463,
    "word_count": 239,
    "sentence_count": 8,
    "position_in_doc_percent": 91.6,
    "created_at": "2025-12-26T22:10:01.474681",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 46
  },
  {
    "text": "The optional service Freeze your price selection will apply to all Passengers and legs of the booking. The value of the Freeze your price option is for each Passenger and for each leg of the reservation, which will be informed during the purchase process, detailing the final price and conditions of the same before completing the purchase of the option. The value of the Freeze your price option is not refundable or reusable for another reservation, nor will it be deducted from the price of the reservation at the time of purchase and full payment. Set the Price allows you to keep available only the price of your reservation. The values of the options that were available on the date of the reservation but were not selected and included in the reservation will not be frozen. For better understanding of the above, in the event that the customer has selected the Pack Vuela Ligero (“Flight Light Pack” whose price is included in the value of the ticket), the price of any optional service available at that date at www.jetsmart.com will not be frozen, but only the final price of the Pack Vuela Ligero reservation.",
    "chunk_id": "condiciones-generales_p46_c1",
    "content_hash": "32a93365ffb8595d7f039cf250d7648735e94d912fb4fc411cdeea8d51505c51",
    "chunk_index": 1,
    "token_count": 218,
    "char_count": 1120,
    "word_count": 194,
    "sentence_count": 6,
    "position_in_doc_percent": 92.37,
    "created_at": "2025-12-26T22:10:01.475295",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 46
  },
  {
    "text": "In the event that the customer has selected a SMART Pack or a FULL Pack, and contracts the Freeze your price option, the final price of the full Pack will be frozen, including the respective options included in each of them, but the price of any additional option not included in the respective Packs, which may have been available at www.jetsmart.com, will not be frozen.",
    "chunk_id": "condiciones-generales_p46_c2",
    "content_hash": "b31d524ccdd569976c01ba537b130c5f617367e503a0bd3130d5f8af747da833",
    "chunk_index": 2,
    "token_count": 76,
    "char_count": 372,
    "word_count": 65,
    "sentence_count": 1,
    "position_in_doc_percent": 93.13,
    "created_at": "2025-12-26T22:10:01.475489",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 46
  },
  {
    "text": "47\nThe Freeze your price option is not offered on all JetSMART flights, and the company reserves the right to offer or not this option during the purchase process of its flights at www.jetsmart.com. Freeze your price is not available through the Contact Center. It is only available for purchases at www.jetsmart.com. Freeze your price will only be available on flights determined by JetSMART, and provided that the quotation is made at least seven (7) calendar days prior to the first flight of the reservation. For the purchase of the optional Freeze your price the client will only enter their data and will not have to input the list of all the Passengers of the reservation, this will only have to be done at the moment of purchasing the tickets and paying the total amount of the reservation. The customer who has purchased the Freeze your price option must purchase the tickets and pay the full amount of the reservation within the selected freezing period, i.e. within 24 hours or 48 hours from the time of purchase of the option, as the case may be. The purchase and payment of the reservation whose price has been frozen must be completed in the \"Manage your trip\" section at www.jetsmart.com within the corresponding freeze period, by entering your name and surname or e-mail address and reservation code.",
    "chunk_id": "condiciones-generales_p47_c0",
    "content_hash": "728f4417c5bf4ed574ea9327156a5c5e490ceda211f62eb7144e8b789bbe53e5",
    "chunk_index": 0,
    "token_count": 263,
    "char_count": 1316,
    "word_count": 225,
    "sentence_count": 7,
    "position_in_doc_percent": 93.89,
    "created_at": "2025-12-26T22:10:01.477697",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 47
  },
  {
    "text": "In the event that the client does not pay the total value of the reservation within the selected freezing period, the validity period of the option will expire and the right to freeze or change the price and availability of the reservation will end without the right to any refund or reimbursement for the client of the value paid for the Freeze your price option. The customer will not be able to extend the freezing period of the price and/or availability of the flights, therefore, after the expiration of the optional period without making the purchase and full payment of the reservation. The customer will have to quote their flights again subject to the values and availabilities informed at www.jetsmart.com at the date of the new quotation. We will send a reminder to the customer prior to the expiration of the selected price freeze period, so that they can plan ahead and make the purchase and payment of their reservation before the expiration of the freeze period. The reminder will only be sent by e-mail to the e-mail address provided by the customer at the time of the purchase of the optional, being the customer responsible for any error that may contain the e-mail address entered at the time of registration. Without prejudice to the foregoing, it will be the customer's responsibility to make the purchase and payment of their reservation before the expiration of the informed deadline, regardless of the reminder that JetSMART may send as part of its service commitment.",
    "chunk_id": "condiciones-generales_p47_c1",
    "content_hash": "2c2c5008542f1048cf6c1b43f1d89721f69073458ef05f90c2b5e5e2eb327a1b",
    "chunk_index": 1,
    "token_count": 276,
    "char_count": 1492,
    "word_count": 252,
    "sentence_count": 6,
    "position_in_doc_percent": 94.66,
    "created_at": "2025-12-26T22:10:01.478162",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 47
  },
  {
    "text": "Consequently, in the event that for any reason the customer does not receive a reminder from JetSMART, this shall not give rise to any claim or liability for the company. The optional Freeze your price does not ensure that the flights quoted may not drop in price at www.jetsmart.com even during the freeze period, JetSMART maintaining the right to carry out any commercial or promotional action in relation to such flights, in accordance with the law. In the event that the frozen price is higher than the price published during the freeze period, the customer may choose not to use the frozen price with the optional and make a new quotation and purchase their tickets at the then available value at www.jetsmart.com subject to flight availability, without the right to any refund or reimbursement to the customer of the value paid for the unused Freeze your price optional.",
    "chunk_id": "condiciones-generales_p47_c2",
    "content_hash": "a66bf9a4d31f12de0710ab522d0b341e3dd46967c38827cc6706ea5cb6ff0a0a",
    "chunk_index": 2,
    "token_count": 168,
    "char_count": 876,
    "word_count": 148,
    "sentence_count": 3,
    "position_in_doc_percent": 95.42,
    "created_at": "2025-12-26T22:10:01.478443",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 47
  },
  {
    "text": "48\nThe Freeze your price option does not allow refunds or changes of any kind, even when the FlexiSMART option has been included in the quotation, which will only apply to the reservation once it has been purchased and paid in full. The right granted by the Freeze your price option is personal and non-transferable, to the customer who made the purchase of the option and who must be included in the reservation, and upon completing the payment of the reservation within the freezing period, the customer must remain in the reservation and may not modify the total number of Passengers, nor the flights, destinations and/or segments selected, in accordance with the quotation for which the Freeze your price option was contracted. Once the reservation has been purchased and paid in full, before the expiration of the freezing period, the tickets and options purchased will be governed by the general conditions and particular regulations, without any right or benefit for the Passenger derived from the Freeze your price option used in its purchase. Hotels, car rental and ground transportation booking On JetSMART.com you can find access to sites or platforms of third parties, which offer optional services such as hotels, car rental and ground transportation booking, should you want to hire such services for your trip. The services referred to above will be provided exclusively by such third parties, under the conditions agreed to them by the Passenger.",
    "chunk_id": "condiciones-generales_p48_c0",
    "content_hash": "fb9411171238e51fed27b172163baa11daf05b5c5f9fd1a1c1bb8987d01f9062",
    "chunk_index": 0,
    "token_count": 268,
    "char_count": 1462,
    "word_count": 238,
    "sentence_count": 5,
    "position_in_doc_percent": 96.18,
    "created_at": "2025-12-26T22:10:01.480211",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 48
  },
  {
    "text": "The services referred to above will be provided exclusively by such third parties, under the conditions agreed to them by the Passenger. The terms are informed in the booking process, and JetSMART Airlines is not responsible for such contract or the obligations arising therefrom, without prejudice to the responsibilities that the law may impose. Buying Insurance At www.JetSMART.com Passengers can purchase various types of insurance should they want to purchase such services for their trip. The provision of all services leading to the contracting of insurance will be carried out solely and exclusively by Chubb Seguros de Chile S.A., Rol Único Tributario N° 99.225.000-3, located at 222 Miraflores, 17th floor, Santiago, Chile (\"Chubb\"), including its sale, distribution, brokerage, etc. Consequently, the issuance, modification and cancelation of the policies associated with the insurance contracted will be carried out directly by Chubb. In all matters related to the contracting of insurance, and in general any issue related to the services rendered and/or products offered or sold by Chubb, the terms, conditions and limitations established by the latter and by law shall apply. JetSMART Airlines will exclusively limit itself to making the www.JetSMART.com portal available (the \"Portal\") so that Chubb can market the aforementioned insurance and third parties can acquire it.",
    "chunk_id": "condiciones-generales_p48_c1",
    "content_hash": "8095d04e2eadd10ff1f17a40bd79e30722c148de50716df1e68fadd6bd3ce708",
    "chunk_index": 1,
    "token_count": 276,
    "char_count": 1389,
    "word_count": 208,
    "sentence_count": 7,
    "position_in_doc_percent": 96.95,
    "created_at": "2025-12-26T22:10:01.480739",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 48
  },
  {
    "text": "JetSMART Airlines will not be liable for interruptions, failures or crashes of the network / Internet, loss of profits as a result of such crashes, or any other direct or indirect damage that may be caused to third party acquirers of services provided by Chubb through the Portal, except for causes that are attributable to negligence of JetSMART Airlines or that by express legal mandate are of the responsibility of JetSMART Airlines.",
    "chunk_id": "condiciones-generales_p48_c2",
    "content_hash": "2609934a6d5051820aa73c02479e99076ab9886e93c64bb7bb8dcdb311e13347",
    "chunk_index": 2,
    "token_count": 83,
    "char_count": 436,
    "word_count": 72,
    "sentence_count": 1,
    "position_in_doc_percent": 97.71,
    "created_at": "2025-12-26T22:10:01.480860",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 48
  },
  {
    "text": "49\nJetSMART Airlines will in no case be an insurance company, sales agent and/or insurance broker. In view of the foregoing, the Carrier will not provide advice of any kind on insurance matters, will not issue, modify and/or cancel any policy associated with the insurance contracted, will not have or assume any responsibility under the policy issued in favor of the third party, will not be responsible in any case for any claim or any other matter related to or arising from the hiring of insurance provided by Chubb, nor will it comply with the legal obligations established by the law in force for such entities. The detail of the terms, conditions and exclusions of the insurance provided by Chubb is indicated in the general and particular conditions of the policy(s) contracted, which accepted by the contracting party will link Chubb with those who contract the services they provide. In accordance with the foregoing, and notwithstanding the obligations and responsibilities that by express legal mandate are of JetSMART Airlines, Chubb will be the only one obliged to fully comply with the conditions offered to the Passenger in relation to the insurance offered by Chubb in the Portal and the law applicable to the provision of its services, being its responsibility to resolve any matter related to or derived from such provision.",
    "chunk_id": "condiciones-generales_p49_c0",
    "content_hash": "0a797cf070d8059a05d3b6c09eb2277cd437480656c8d5cb98ec7c07b63fe26d",
    "chunk_index": 0,
    "token_count": 250,
    "char_count": 1343,
    "word_count": 221,
    "sentence_count": 4,
    "position_in_doc_percent": 98.47,
    "created_at": "2025-12-26T22:10:01.482132",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 49
  },
  {
    "text": "Chubb will be exclusively responsible for the payment of any fine and/or pecuniary sanction and/or compensation of any kind, due to or on the occasion of the omission or partial and/or inopportune fulfillment of the obligations contracted by it in favor of third parties, including especially the eventual compensations that could result from contractual or extra-contractual responsibilities and that could have a direct and/or indirect relation with the rendering of its services, notwithstanding the obligations and responsibilities that by express legal mandate are of JetSMART Airlines.",
    "chunk_id": "condiciones-generales_p49_c1",
    "content_hash": "7bd898e1fd4458a0e0f64257f6ba8e7bf98f5992e04ef38533a79d1e2d90ab9f",
    "chunk_index": 1,
    "token_count": 105,
    "char_count": 591,
    "word_count": 86,
    "sentence_count": 1,
    "position_in_doc_percent": 99.24,
    "created_at": "2025-12-26T22:10:01.482309",
    "source": "condiciones-generales.pdf",
    "source_name": "condiciones-generales",
    "source_path": "/Users/linkages/Documents/RAG/condiciones-generales.pdf",
    "file_name": "condiciones-generales.pdf",
    "file_extension": ".pdf",
    "file_size_bytes": 485381,
    "file_size_mb": 0.46,
    "file_modified_at": "2025-12-26T21:57:41.441587",
    "processing_timestamp": "2025-12-26T22:10:01.274397",
    "total_pages": 49,
    "page_number": 49
  }
]